["Good deal", "Love it!! Great way to transport tons of pictures & files! I bought a case for mine, but the actual backup isn't much bigger than my cell phone.", "I purchased this item to be use with my Mac as the reviews said that was possible. At first I encountered some difficulty as this disk is pre formatted for Windows.\nHowever, it is possible! If you are only using this external hard drive to drag and drop files/documents etc, all you need is to download Paragon Driver (that will be provided upon initial installation of the drive). However, if you are like me and intend to use the drive with Time Machine, you need to reformat the drive to be used with Mac. I couldn't figure it out on my own so I called Seagate tech support and they helped me reformat the drive to OS X extended (journaled). When in doubt, ask for help. It just took 20 minutes.", "Compact HD, smaller than my cell phone. Happy with my purchase.", "Not much to say, really.  It is a portable drive and it has worked just as one would expect.  I've had no problems thus far!", "Its really heavy but very compact. I expected that i will get nearly 3.9 tb but I end up with 3.63 tb. Yes i tried in almost 7 different range of computers but still the same.", "Like it", "Great drive that works well with a 2015 Macbook 12in Retina laptop and the USB-C adapter, meaning it has enough power to connect and mount in disk mode mode. No issues to report and drive works well with TimeMachine. Speed is good and is compact size.", "Slow. Really slow :(", "Serves it purpose.", "I have both the 'fast' and regular versions of the 4TB model. Great drives. Bus powered on my MacBook Pro and easy to carry around. I am a professional photographer so these make it easy to have multiple backups on the go. Note: these should *not* be used stand alone without other backups. The way the two drives are stripped is great for speed, but *guarantees* data loss if something happens to one of the drives. These are great for fast secondary, tertiary+ backups.", "Great bang for the buck!", "Cheaper than I thought it would be, used it to upgrade PS4 hard drive, love the room and the carefreeness I can be about installs. Get this. Easy to do if you know what you are doing.", "very useful product to backup my data", "Very portable, easy to use, haven't had an issues with it. Great for the value!", "I'm not sure what to say. The instructions are horrible. I have absolutely no idea how to transfer my Mac files onto this external drive. I like the idea of it. The &#34;how to&#34; videos are worthless.\nI'm left with a product I've been given no instructions to set-up and use.", "Love this  seagate... not like  Toshiba...drop them and you have lost all what is on the hard drive... Seagate...you won't at I have not.....", "good", "Needed more space for games and data on my Xbox One. This worked perfectly. Plugged in, option to format, then immediately available for storage. Great purchase!", "Excellent drive. Works with my ibm PC's up to USB 2. This drive did not work with my older computers using plain Jane USB (before they rated them more than just USB). The older computers don't have enough power through the USB for these very large drives. My Mac book was able to read the drive, but could not write to it, forcing it to write (Jiggling the USB connection) was a mistake, I don't recommend jiggling USB connectors.", "HIghly recommend external drive this will also back up your Iphone or Android", "Highly disappointed.  This product simply will not backup with Time Machine on Mac, but worse is Seagate's customer service.  I followed the prompts and filled out a service ticket and simply never heard back from them after two weeks.  I then called them and spent almost an hour with a technical service representative who was nice, and tried, but was ultimately unable to help.  I later received an inquiry from Seagate to determine whether I was satisfied with its product and promising that &#34;we read all of your comments&#34;.  I then described the above problems, but still have not been contacted by them, only Amazon seems to care.  Months have passed.  It gets one, instead of zero, stars because it appears that I can manually move files onto this drive.", "Awesome!!! I love it and i could start having all my pictures in 1 place :) works great", "small size, big storage size, at a great price", "I trust Seagate and WD. Powers down a lot. Quite annoying.", "good", "good", "I have 2 of these- one I use to install and play my Steam games off of, and one I used to replace the stock 500gb drive in my PS4 (in which case  you have to pry the drive open to get it out and put it in the PS4, which isn't too hard but does void the Seagate's warranty). So far it has worked great for both of my uses, with no issues. I like that it has an aluminum top, which helps dissipate heat much better than plastic (most drives of this type are all plastic). It also has a 2 year warranty whereas most drives of this type only give you one year. It is also rated as one of the fastest portable external drives in all the reviews I read. So I'm pleased with them so far.", "Worked amazingly for PS4.  Highly recommend taking the cover off with your nails, not using a tool like some sites recommend.  It can be taken off in literally 3 seconds, this was the easiest upgrade ever.  Super simple.", "This DOES NOT work with PS4!!!!!  I bought this for extra games storage.  Maybe theres a way but i havent figured it out.", "Seagate is the brand for me. Its simply reliable.\nI owned several other brands in the past: Toshiba, western digital, hitachi but Seagate by far is the best of all.\nThe worse thing it can happened to you is having one drive failing on you, and that happened to me with toshiba, wd and hitachi. I lost music, movies and the most valuable of all the data...pictures. I bought this exact model 1 year ago...and its working as the first day. Also in the worse case scenarie the HDD comes with 2 year of warranty (which is 1 year more than most of the other brands)\nThis drive is insanely small and thin, I can put it on my shirt pocket without adding any bulk to it. USB 3.0 offers you lightning speed to transfer anything, so if you're making a backup and the ETA is displayed in hours, forget about that, it won't be happening again with this baby.\nThe design is awesome, it has an aluminum body thats gives you that sense of good quality/build.\nThis drive includes an special offer that provide you with 200Gb of storage in OneDrive, which is nice mainly because these days you may find running out of space on your smartphone. Just keep in mind that there is a limit to redeem the offer (mid 2017)\nThe only thing I personally would like to have...is a carrying bag. Unfortunately this HDD does not come with anything to travel, unlike other brands.\nSo if you're looking for a reliable HDD, give this drive a shot...I'm pretty sure you won't regret.", "Quit working after being back up drive for my MacBook Pro for 10 months. Now its a beautiful red paperweight! Won't buy Seagate again.", "WORTHLESS----FOUND OUT NOTHING WAS BEING BACKED UP WHEN I TOOK IT TO APPLE STORE----FORTUNATELY RECEIVED REFUND AS IT WAS UNDER WARRANTY", "Fast transfer times via usb 3.0. Practically free of bloatware unlike other brands. The only software loaded onto the disk was seagate's setup utility which basically just connects you to their website and register the product, There are some disk management software (seagate dashboard) you can download when you register the disk provided by seagate. You are also given a 2 year 200 gb free cloud storage by OneDrive by Microsoft. It is small and light. Measurements available in product description. Also comes with a usb cable. I do not use seagate's dashboard but simply use file explorer to manage my drives. Seagate's dashboard provides you with a more friendly graphical user interface to copy, move, backup or whatever way you want to sort your data, No negatives at all whatsoever. Afterall, it's seagate and they've been making drives for decades.", "Amazing", "Good", "great value for a 4TB portable ext. harddrive.\nJust started using the drive so can't comment on long term use but so far so good.", "Got this one for my papa as a gift this coming Christmas and I am sure that he is gonna love it because it's 2 TB storage allowed me to fill it with his favorite classic movies and concerts.", "Great item, highly recommend.", "Arrived quickly in good shape, installed immediately, clear instructions, connected via the usb 3.0 port, quickly backed up 900 GB of critical data, and had no problems. Well done Seagate & Amazon [as usual].\nBy the way, I have my own &#34;cloud[s]&#34;.", "After years of owning WD drives... I finally switched over to Seagate. None too soon as my WD passport crapped out after 4 years of light use. This is the best yet, slightly slower r/w speeds... but so far most reliable. Knock on wood.", "Turning it into a PS4 harddrive and using the stock ps4 one as the external hard drive was so easy, just YouTube it. I'm writing this one year after purchasing and I can tell you I've had no problems with it. In fact I don't get as many application errors as I used to with the hard drive that came with the ps4. And now I have a nice little 500 gb external hard drive (the original ps4 one) and plenty of memory on my ps4 :D would recommend to everyone.", "Item seemed to work fine as I reluctantly downloaded all of my college work, personally created music & photos; however, the item recently failed to be recognized by any PC which it was connected to. Purchased an additional cable after reading several blogs with customers having the same issues, yet light still only blinks. This item was used less than five (5) times total, before it failed. There are no words to describe the feeling of having possibly lost information that I worked incredibly hard at creating.\nConsidering the amount of times this device was used, and the time since it was purchased before it failed, I have no choice but to issue a one (1) star rating. Note: As one can see, the items has been very well taken care of (see attached).", "Talk about small but useful?  This is about as good as I think it could get.\nPlan on converting all the wife's VHS movie collection to download format to store on this drive to save on weight and space in our New Travel Trailer.\nIf this works as I hope, it will have saved over 12 cubic feet of space and about 120 plus pounds in handling the tapes; not to mention not needing the VCR/VHS to playback any longer.\nThis and Dish Anywhere Service together with streaming services should be able to take care of any Movie/TV series entertainment needs we may think we want to address.", "Great external hard drive. Bought for my Xbox1 it formatted it in no time and i havent had any problems since.", "No problems here. My first Seagate was dropped and stopped working, so this is an upgrade and replacement.  It does exactly what it says it will and I've never lost a piece of data using it.  I love the compact size and the ease of carrying it along with the laptop.  The interface is intuitive and easy to use.  I would recommend it for a home office as a small, effect data storage and backup system.", "This nice backup drive stop working excatly 2 days after I can return it to Amazon. I contacted Seagate for the &#34;2 year warrantu&#34; and I was told by the customer service that becuase I purchased from Amazon I don't have the same warranty. DO NOT BUY!!!!", "Purchased for PS4.  Worked perfectly.  Took me about 10 minutes using this guide - https://imgur.com/a/JF5jA\nOne word of caution, if you are looking to do this on the PS4, make sure your PS4 can read USBs.  My friend bought the same one and when we went to back up his PS4, it would not read any USB's, including the same USB that I used to do my backups only a few hours earlier.  Reformatting to FAT32, eXFAT, etc did nothing.  So make sure your PS4 can read a USB before you spend the money on the HDD.\nBut once you know you are good to go, this is the way to go.", "I bought it.  loaded it up with all my files. Two weeks later, I suddenly could not access it anymore. Whenever I plugged it in, it said that it was fine and ready to go. But it didn't show up in any of my harddrives. I tried more than a dozen recovery programs to get the files off the drive, but NONE of them would recognize it. I see this is offered cheap all over the place. Why? Because it's crap. Save your money.", "Great drive. I have 5 Seagate drives over several years. Works on my mac, and if I have to connect it to a PC as well.", "My son is a senior programming engineer and he recommended this for my external backup drive on my Apple Computer.  It is very lightweight and we were able to set it up with a divider so I can back both my desktop and MacBook Pro laptop on the same backup drive.  It's a small and attractive addition.  My previous drive was clunky by comparison.", "Very handy and portable..", "Great drive. I've had two of these for a year now. Each one used to extend the storage of Xbox One consoles. They work really well as extra Xbox One space, the console recognized it right away and started using it. Since then, they've endured hundreds of hours of Xbox One gameplay. I noticed today after playing Fallout 4 from it for several hours it was slightly warm but still chugging along no problem. Its sitting behind the console in our entertainment stand, it doesnt have the best ventilation but even with the console blowing heat in there it still runs great. A glitchy game like Fallout 4 has never froze, or crashed while running from the drives. I liked them so much I just ordered another one for more storage on our server. It will replace an old 320gb Seagate external drive that has been running for the last 7 years with no issues. I used to prefer Western Digital, but Seagate has really proven to make some durable hard drives. With so many positive reviews on here its safe to say you're likely to have a good experience. All hard drives are prone to failure, moving parts, heat and many other factors will contribute to their death. Its easy to hate a company immediately once you lose your data, its not the drive manufacturer's fault you lost your data. They may have made a faulty drive, but you didn't protect your data with redundancies. If your files are truly important you'll buy two of these drives to double up on your back ups, or maybe even better, put them in the cloud to protect against fire loss. I've learned the hard way and lost memories I can't get back now. Thats why our master closest is literally 1/3 server cluster with hard drives..and drives backing them up.", "very good", "An external hard drive isn't useful if it stops working. Ours was never dropped, and kept in a secure location where no physical problems could have damaged it and now it doesn't work. The device when plugged in just emits a beeping sound and isn't recognized by any computer. Also the customer service for Seagate is non-existent.", "Excellent portable drive for the price, very very small and quick with the 3.0 usb connection.", "Fails at writing and disconnects. Waiting on replacement", "Just as described!", "Nice", "Bought it for 200, a bit expensive. I got this because I desperately need something more than 2T. Have reading failure couple of times, replugged and it's okay, no data loss yet (just 2 months in).", "None", "Awesome deal for my PS4 HDD, really easy to install and very fast to upgrade.", "Fantastic hard external hard drive for my Xbox one and my laptop. I would recommend this product for anyone who needs a great external hard drive for the perfect price.", "Great Hdd", "I love this drive! works like a charm with my Surface Pro3, plugged it in was instantly recognized by windows 10. Quiet operation and does not generate a lot of heat. Cannot go wrong with a Seagate Drive. Seems to read and write quite fast.", "I am amazed at the transfer speeds for an external drive.  It's easily as fast as my internal sata III drives, yet is small, light, durable, and portable.  I've had it and used it for over a year now, after my 3-year-old knocked it off tumbling down a sequence of hard surfaces, and it was completely un-fazed- no data loss or corruption, no decrease in access speads with continued use.  Count me in as a very satisfied customer.", "Very stable and reliable mobile Hard-Drive.", "Doesn't work, I received an error message every time I tried to backup my computer", "Very compact and metal finish is just amazing. Speed also is so far so good. Will update in case of any issues.", "SLOW", "Convenient and, so far, reliable (using only few weeks). I moved all my videos, photos, and other room consuming files but it's still a lot of room left.", "None", "Easy to use, sleek and light!", "Great price, great back up for information.", "None", "Thank you", "The product was easy to set up and I have not run into any issues with it. I have it connected to my router for network storage. Good product and was worth the price.", "Excellent product perfectly thin for its capacity. It works great for my backup of my Macbook Air for Time Machine.", "Slim and elegant, Perfect for daily use.\nSatisfied :)", "so far so good, better than the hp which i had major problems with", "excellent fast drive. roomy, quiet and quality seems quite good so far.", "Dead on arrival. I just moved overseas and can't even return it. When I plug it in, I just hear a constant subtle beeping sound. Wasted $180 on this one.", "None", "The main purpose I bought this hard disk for was not served. I wanted to take mobile backups, but the Seagate Dashboard app is not working correctly. It keeps disconnecting which is very frustrating. I could have bought a 3tb or 4 tb of external hard disk for the same price without this feature. Disappointed with this mobile backup feature but the hard disk works fine.", "Bought the drive in June. Now it's dead! Return it to Amazon or Seagate?", "Working.", "I love it, excellent product", "None", "great item", "Do not buy this if you have a Mac, because you have to reformat it, which is a pain (have to go to Seagate website for instructions)."]