["It protects my phone.  I have dropped it a few times from tabletop level and no damage to the phone.  No interference with putting the charging cord in the bottom.  Easy access to the mute button. I love the slim design.  I keep the phone in my pants pocket, and it isn't hard to pull it out while seated.", "loved it!  it's exactly what the pictures shows.", "None", "None", "None", "None", "None", "None", "None", "Love it! I don't particularly like the screen cover, as it doesn't fit really well and moves around a tiny bit. I am pretty sure a glass cover and this case would make a perfect combo!", "None", "None", "None", "None", "None", "Fits the iPhone 6S like a glove and offers very good protection without adding bulk.", "None", "Case started scratching within a week of use. Not a good product.", "None", "Excellent case and very sturdy. Really helps protect my phone without being insanely bulky or making my phone look like crap! Great product!!", "None", "Tough, easy to use, and relatively inexpensive. A great product at a great price. It has saved my phone on multiple occasions. I would just advise that you partner it with a screen protector of some kind to protect from the scratches that this will not cover. Great overall.", "None", "None", "None", "It's a good case and very strong.  The reason I give four stars is because it is slippery. This is not fall of the case .  This is just fundamental ability of the plastic.", "This is a badass case I would recommend it to anyone", "None", "None", "It works and it looks good", "None", "Good fit, however if you want to keep a light phone this is a heavier protection.  I love this outside of the otter box models and don't mind the weight end, as it is comfortable in the pants and easily accessible", "None", "None", "None", "I am very pleased with the quality and style of my case", "I bought this case because my brother has one and loves it. I do not have any complaints about this case, it definitely helps protect my phone. (I have dropped it several times).", "None", "None", "None", "None", "It gives the phone some weight and grip.  Feels comfortable in my hand and so far has protected it from short drops.", "Awesome Product!  Love love love!!!", "None", "None", "None", "None", "great case. my favorite case over had", "None", "None", "None", "Great case. Right amount of protection without adding to the weight of the phone too much. Get compliments on it all the time.", "None", "None", "Love it.  Has saved my phone more than once.  Looks good too.", "None", "It serves its purpose and has a good fit. It is slender if that is what your looking for. Not overly stylish.", "None", "None", "best case so far", "None", "One of the best cases i dropped this phone at least 50 times it once fell out the car when i was snap chatting and it survived overall get this case", "None", "None", "None", "None", "None", "None", "Excellent", "Wrong item"]