["basic socks, great value", "Perfect, love that I don't have to.go to the store. Just order and it's at my door", "Other than a pair having a red/orange stain, they were worth the purchase.", "nice socks", "Good price, good fit; it remains to be seen how well they wear.", "Nice socks! Fits comfortably. Has good padding underneath", "good!", "Second time ordering good quality", "Good", "This review is for Hanes Men's 10 Pack Ultimate Crew Socks (White) and it was shipped from and sold by Amazon.com.\nThe package I received says 84% Cotton/13% Polyester/2% Rubber/1% Fiber where the site says 79% Cotton/16% Polyester/3% Rubber/2 Fiber.  No complaints here since I am receiving socks with higher amounts of Cotton.  My order has the red Hanes and line at the toes.\nI will provide a update after the initial wash and wear.", "They wrap around your feet like a glove and feel comfy and warm like slipping your feet into a pair of warm pumpkin pies.", "this product fits perfect", "Great value for 10 pairs of comfy socks. Most other socks strangle my ankles. Not these.", "Great socks and no need to pay more elsewhere.", "If you're expecting Hanes crew socks like I wore for decades, you're in for a big disappointment. Their socks were once a delight on the feet, but no more. I suppose these socks are a bargain at this price, but I'd rather pay three times as much and get the Hanes I remember so well. As for me, I'm done with Hanes, after forty years.", "too thin, they will be rags", "Good for the money came and fit as expected", "nice", "Bought as gifts.", "A little thin but good quality", "Their decent socks.", "got them for grandsons, no complaints", "My husband is very happy with his socks.", "These socks run a little shorter than pictured, and they have a little less material than I am used to having.  However, at a dollar per pair, how can you complain?  They look fine, and they should last for an acceptable period of time.  I am pleased with the purchase.", "Perfect", "great socks", "Fit good and good price", "Too short", "Cool and comfortable!", "Fit was perfect. Will definately buy again.", "Good fit", "nice", "Love my new socks. They fit great. And are very warm. I hope that they will last a little longer. Very comfortable.", "Socks are fine. Elastic around the top is a little weak and will likely break some on first wearing. Lasting pretty well for the long run after several months. Will probably be retiring some soon that have gotten toe holes already, but that's normal.", "These are perfect, no matter what activity I'll be doing, the quality remains to be very excellent", "great everyday socks", "Very comfortable socks, warm in the winter, perfect for the gym or at home.  Sturdy too.", "I'm quite excited to get these great socks with such low price!", "The socks are good quality.  Soft and have been holding-up well with no heel holes.", "For budget socks these are a solid purchase. Nothing fancy - not too thick or super luxurious. I tend to pick up a pack of these every 6-9 months, so they work out to be a value for new socks.", "I am a fresh sock person. Love the feeling of fresh socks. 20 years ago I felt I wanted to be rich enough to wear a fresh pair of socks every day. When I reached 50 my goals changed slightly. But I still love the feel of new socks. And this brand is still #1 on my list.", "Great socks. I got exactly the size I wanted. These fit well and are very comfortable to wear as well. Will likely order more some time in the future.", "Good fit and value", "Good price", "Mmmmm.....snuggies!", "Meets expectations and no complaints", "Really like these socks.  You can't go wrong with Hanes.  They fit as expected and are excellent quality.", "total right leg amputee,these will last me rest of my life hahahahahaheheheheheh", "Nice socks. Soft but still holds their shape when thrown in a washing machine. good buy", "Buying them is all good, the quality is very nice and way better than expected"]