["I want ALL the colors.", "The best headsets at a nice price and this is one ...", "the quality of the sound though is great.", "Very good set!", "Don't sound all that great, even at this price", "Perfect gift", "Have really good bass", "Five Stars", "AWESOME Sound for money  \u001a", "Not Beats but work for me!!", "One Star", "Great quality", "Incredible sound for the price!!!!!!", "The conference ones were crap. These sound really good", "Five Stars", "I love the sound of these", "One Star", "Four Stars", "Excellent headphones. It's great if you want to listen ...", "DON'T BUY!!!!", "Awesome product.", "Cheap alternatives", "They work fine until then", "Using since a few weeks and the sound quality is great . . .", "You get a solid pair of headphones for what you pay for.", "My workout go to", "Five Stars", "Ordered two pairs, left ear bud stopped working on both", "Four Stars", "Great sound. Comes with different size tips for different ...", "Four Stars", "they will not disappoint.", "Five Stars", "Four Stars", "Five Stars", "Five Stars", "love", "Two Stars", "Despite some shortcomings, good value all the same", "The Best Choice", "Stop buying Skullcandy's.  Unbeatable value here.", "Five Stars", "Cheap price, great quality", "I can sleep again!", "Inaccurate depiction - White&Silver", "For the price, they're exceptional", "Best sound for the money", "he liked it but unfortunately with the new iphone 6s he ...", "Best Quality Earbuds for Price", "Five Stars", "Four Stars", "Five Stars", "They're okay.", "Headphones are amazing. I was skeptical that a headphone this cheap ...", "Five Stars", "really great buy!", "Five Stars", "Comfortable", "Would Buy Again", "... a gift for my 2 years old girl who love so", "Five Stars", "Pretty awesome for the", "Very happy with this purchase \u001a", "Perfect", "Work great, do not hurt my ears", "Five Stars", "Five Stars", "A Great Buy...", "Five Stars", "Sounds great. They fit pretty snug in my ears and ...", "other than that good clear sound", "Cheap Quality!", "Four Stars", "Four Stars", "Four Stars", "Two Stars", "Love these ear buds", "Five Stars", "Nice headphones", "Keeping it simple", "Five Stars", "Five Stars", "Five Stars", "Feel the beat.", "Will buy again and again and again", "Great value", "Really inexpensive and sound decent for their measly price.", "DURABLE, NOISE CANCELING, GREAT SOUND QUALITY, I OWN 5 PAIRS,", "Cheap but gets the job done", "Five Stars", "Five Stars", "Work great", "Buy a few pairs - your wife might steal them from you.", "Best headphones Ive used (Compared to Samsung S5 headphones and Skullcandy)", "Four Stars", "Can't beat em", "They still work great. Awesome purchase for inexpensive headphones", "Sound nice", "Impressed", "low cost great quality", "Good buy!", "Very Happy", "Five Stars", "Good for Backup Earbuds", "Five Stars", "Not Disappointed.", "Very little bass, best for speech. Kasstino was way way better and has mic", "Five Stars", "I didn't expect the amazing quality and design that Panasonic put in these headphones", "I love these headphones", "Five Stars", "Sound quality is good in my opinion (my hearing isn't great though)", "Solid fit, great sound, great price.", "Excellent Sound, but design isint very good..", "Plastic part behind the rubber earpiece is too large for ...", "best", "Five Stars", "Five Stars", "Best earbuds for the price, durable, and sound quality is pretty good.", "Five Stars", "Absolutely love the sound out of these set", "can clearly hear", "The other reviews are true!", "Easily the best \"cheap\" earbuds around!", "Comfortable", "... these a couple months now and they have been wonderful. The sound quality is amazing and is great ...", "Five Stars", "Two Stars", "Arrived promptly. Good buy.", "Great!", "Best ear phones ever", "Just okay", "What a nice earbuds very comfortable and great sound", "One thing only...", "Five Stars", "They were good, but like most headphones", "Great quality, great price", "Five Stars", "Four Stars", "Five Stars", "The plug in is not universal so it can't properly ...", "Four Stars", "Those are wonderful but come on at 300 dollars they better be", "Five Stars", "Easy 5 stars!", "Nice headphones that fit very comfortably", "Five Stars", "One Star", "Three Stars", "sound is pretty good though", "Sounds poor!!", "Nice buds!", "Five Stars", "These lasted exactly 10 days before the right earbud stopped ...", "Good earbuds", "is so good", "Great!", "nice earphones", "Good solid cheap earbud", "Got the black one first. It lasted for 5 ...", "Good enough", "GREAT headphones for the price", "Well priced good earbuds", "These sound amazingly good for the price and never get tangled", "Good Headphones", "Great quality, sound, and price!!!", "great gift for my brother", "Five Stars", "Not the best bang for your buck", "Panasonic RPHJE120S In-Ear Headphone, Silver", "Solid performance for the cost", "Great quality for the price", "", "The only earbuds I'll buy", "Five Stars", "Great Value !", "Great, affordable, comfortable ear buds.", "For a cheap price these earphones are the best I've had", "Great for the price!", "", "Good headphones at a good price! You really cannot beat the sound quality you get from these little guys for the money paid. They come with different in-ears to change to your preferred size and are very comfortable. Be careful, once you get a listen with these, you won't know how you lived without them!", "The best headsets at a nice price and this is one of the best Products from Panasonic.  I will recommend this to everyone and this is very versital", "it doesn't stay inside my ears, it keeps on slipping so I stopped using it and gave it to my son who's not using it either due to the same reason.  the quality of the sound though is great.", "So good my husband steals them....and they are pink! These stay put and have good sound. Perfect for the gym.", "Don't sound all that great, even at this price. I bought them because of the glut of good reviews. I don't even know where they are anymore. Stuffed in a drawer somewhere probably because I only used them once or twice before I decided they didn't sound right.", "We bought 3 sets awhile ago and like them so much that we gave away this set. GREAT JOB noise cancelling.", "Headphones came quick and dont break easily.", "Great sound, good bass, super affordable!", "Theses are great! A little to have in your ear at first and also aren't anything fancy. But comes in a nice package and THEY SOUND AWESOME for like $7.00.", "These work great and sound really good for the price you really cannot complain!", "Very thin cords.", "Superb performance", "The sound quality is incredible! In fact the sound quality is better than ear buds that have cost me $30.00+.\nThese not only sound great but they are really comfortable and actually stay in my ears too.\nI'm going to order 2 or 3 more pair as back ups.\nI can't imagine anyone being dissatisfied with them.", "Bought these to replace the free ones that I received at a conference.  The conference ones were crap.  These sound really good.  I'm floored.  May buy more.", "wife loves them they dont slip out during running", "I love the sound of these. I've bought a few pair and wouldn't say they last forever, but I really like the sound and comfort.", "JUNK", "good", "Excellent headphones. It's great if you want to listen to music while biking (I only put one ear-piece on while biking so I can hear other noises with my free ear) because it's wind proof!", "The quality of these are awful.  I bought these two weeks ago and one of the earbuds has already stopped working.  Waste of money!!!", "Very good sound quality, good fit and the price is right.", "if you you need a decent Headphones and not spend your life savings,this is the way!", "I've purchased these headphones three times in the past 2.5 years. My third pair just broke. They work fine until then, but they really should last longer than that.", "Sound quality is great !  Bought a couple of weeks ago for my wife and she only uses it.  She says it is very fine . . . .", "Exactly what you would expect for the price, these guys simply work. I appreciate the extra ear-bud sizes, although the default ones actually work for me. Besides foam earpieces from Etymotics, this is the only pair of ear-buds that has fit my ears correctly - all others tend to slip out of my ears.", "My favorite earbuds so far.  My husband has got tens lots of earbuds for me and they are never very comfortable to me.  These ones stay in without me jamming them.  They stay in through my whole workout too, bonus", "I bought a pair and a spare- very comfortable and I love the color!", "I ordered two pairs of these.  One to use during workouts and the other to listen at my work desk.  In both pairs the left ear bud stopped working after only a few months of light use.", "Good price and they work as expected", "Great sound. Comes with different size tips for different size ears. Fits well into ear and blocks out room noise, so you don't have to turn the volume up as loud to hear it.", "Good product.", "This are surprisingly food! And cheap! :D. Buy them, they will not disappoint.", "Great!", "Fits in ear flexibly", "good", "Just as expected", "second pair. love these", "not what expected", "These ear bud headphones works fine. They don't tangle as much as some other ones that I had tried. It came with different size ear buds so I was able to find a pair that fits. Sound quality is decent. The button works with my iPhone 6. But doesn't seem to be as &#34;responsive&#34; as the ones from Apple so I sometimes I had trouble skipping songs. But good value afterall.", "I got a pair of these 6 years ago, and they just recently stopped working. They had even been washed 4 times, and covered in nail polish. Favorite pair of earbuds.", "Quality as good as if not better than higher end earphones for the cheapest price I could find.  Best value available, so glad I found these.  They sound the same as I remember my old skullcandy's, only difference is these were a third of the price and this one pair has lasted me as long as 3-4 pairs of skullcandy's.", "Excellent product for the price.", "I LOVE THESE HEADPHONES. They have the perfect crystal clear sound and they fit perfectly in my ears. I also like the bass, it isn't too much but it's perfect for the kind of music I listen too (mostly alternative and dance). These headphones are the perfect solution to getting good headphones at a cheap price. They are durable for the price as well.", "These fit amazing in my ears and are great for sleeping in. The first headphones that are comfortable enough for me to sleep on my side. And the only headphones to ever block out my boyfriend's snoring. I only wish I had found these 3 years ago! Great product for a great price. And I love the colors", "Inaccurate depiction. The Silver one is actually white and silver and does not look as the one illustrated. The entire cord is white. Inner plastic of the headphone is also white.", "For the price, they're a very fine. They're functional and the sound is fine. Plus they have extra ear buds (that's a bonus). I didn't give it a 5 cause I need a little more umpf in my sound and I think this type of ear phone ( this is first time I tried them) is not for me.", "They are cheap and sound good. last about a year with hard use. can't beat the price to sound quality.", "Got it for my bro, he liked it but unfortunately with the new iphone 6s he has to take off his case to have this plugged in. Other than that it's a really affordable earphone that doesn't suck.", "These earbuds are by far the best ones I have owned in the sub-ten dollar range. If you're used to good quality sound from a good pair of headphones or the like, the only thing that stands out immediately is the lower frequency response not being quite low enough. It sort of takes away from what I like to call the &#34;depth&#34; or &#34;atmosphere&#34; of the music. But you get used to it very quickly.\nOverall, nice punchy bass, very clean and elegant mids (this is where they shine) and my biggest complaint is that the highs are pretty bad. They sound almost scratchy, if that makes sense.", "Best earbuds ever, quality sound is great, noise cancel is great, great bass, will buy again for sure!!", "It fits in my ears and it feels comfortable.", "really good sound quality. The head phone jack fits really good on ipads and iphones", "Haven't had them long, but these earbuds are okay, they work, especially for under $7.00. You can't expect amazing sound for that price, but for riding the subway or working out they'll work fine.", "Headphones are amazing. I was skeptical that a headphone this cheap could be of such a high caliber. Well worth the money, and make working out much nicer. Three sets of soft tips were included and I was able to find the right size for my ear. They block most exterior sounds. With a tight seal in the air, they provide a surprising amount of bass for an ear bud style headphone.", "great", "Ive had these for about a year now and they still work the same as they used to when I first got them. I had no idea that one that cost me only $7 would work so well, but these headphone can probably walk through hell and come out the other side still intact. At the possibility of sounding like a lunatic, I'm not joking when I say I throw these headphones around like a rag doll. I treated my previous headphones much, much better than this one and they still stopped working earlier.", "Comfortable and excellent sound.", "Comfortable fit, and fine sound quality. Not sure how long they'll last though.", "Worked well for about 6 months, the one side quit working. Had great sound and noise cancelling. Would buy again.", "bought as a gift for my 2 years old girl who love so much", "These work great! Are good quality sound and fit very comfortable in the ears.  Can't beat this deal!", "Needed a pair of cheap earphones to tide me over while I contemplate another model.  Pretty awesome for the price", "They are good. Very good! Worth all the money. I ordered some other high end headphones and ended up returning them because was just awful. This is good, almost as good as my Bassbuds, actually the fact that they are anti tangle gives them an edge.", "Excellent", "Most headphones hurt my ears after use but these do not,so i love them!", "great", "very very good service and product", "I bought two pair of these. One for me and one for my husband. They are great! They fit well, sound well, and we're able to wear them for hours.\nI, for one, seem to go through a lot of earphones. But, so far, these are holding up well. I would recommend them to others.", "Good quality - fast shipment.", "Sounds great.  They fit pretty snug in my ears and don't hurt after a long time.", "Could be a little louder, other than that good clear sound, comfortable fit. I would buy again.", "I have no idea why this gets so many 5 starts... The quality is so cheap. the cables are so thin. Pretty much same quality as those headphones at 99cents store.", "Good for the price. Gets the job done.", "Good headphones for a low price.", "Good basic headphones", "Stopped working in my smartphone for some reason.", "Love these ear buds, I have tried multiple ones and none fit snug and comfortably... until I received these, they are great. So much so I ordered two more sets.", "Very comfortable in your ear.", "Nice headphones.  Have been using them regularly for a couple years.", "Sometimes simple is the key. These are small and stay in the ear. Sound is fine for the price. Cord is long enough for running in. There isn't a microphone on these....", "Nice headphones with good quality. Works good with my iPhone 6s.", "Very nice earphones for regular use!", "great earphones. i love em.", "Sweet tunes come out heavy with these little wonders. Quality is there. I get pumped up listening to music sometimes, and make the mistake of playing with my dog spontaneously. He has ripped them out a few times and they are still pumping that bass.", "Pleasantly suprised at the AMAZING sound quality and would definitely recommend this product", "These are a great value.  I normally can't wear the contoured ear buds because they don't fit right in my ear.  These are comfortable, have good sound quality, and are even somewhat noise canceling.", "The thin cord has a tendency to tangle easily  and there's no integrated microphone for cell phone calls. For under $10, it will be hard to find in-ear headphones that sound better and are more comfortable than the Panasonic ErgoFit RP-HJE120s.", "LIKES:\n-Durable( use at work and gym),\n- seemingly  waterproof ( has been through the wash many times snd still works perfectly)\n- sound is comparable to $100 headphones which I have purchased many times in the past.\n- Noise canceling ( EXAMPLE: I use at work in the shop when grinding or cutting, I sometimes even grab them to use in place of earplugs there that good)\n- PRICE, PRICE, PRICE, ridiculously underpriced for its quality\n- Colors, comes in many different colors that are all great,  I have red, green, orange, and black .\nDISLIKES:\nThe only NEGATIVE thing about this product is that I keep loosing them and have to come back to buy more.  have 5 pairs I keep a set at, work, with my laptop, in gym bag, in car, and keep a back up.  There also great gifts and stocking stuffers,", "They get the job done for when I go to the gym. They stay in well and are comfortable. I predict they will be durable enough for a year of workouts.  Only had for about 2 months so we will see.\nCons: Sound is a bit muffled but for the gym I do not mind. Don't expect great sound from these obviously. Can't go wrong for the price though.", "Sound good.  No problems.", "Can't beat these for the price. Nothing comes close.", "They seem to work great. I've only used them a handful of times but they feel comfortable.", "The price of these headphones is insanely low for the quality.  Normally, when I see headphones under 10 bucks, I figure it's not even worth giving it a chance because the quality has to be awful and uncomfortable.  Nothing could be further from the truth on these.  I have a few pairs because my wife stole my originals.  She uses them when going to the gym / running.  They are my everyday go-to headphones.  Superior sounds quality for the price.  Probably the best value on Amazon.", "Better than the headphones that some with the Samsung S5, as well as the standard Skullcandy. I've only used those two headphones so I can't compare to others but out of the three these were the best by far. The sound quality is much better, sounds are much clearer, with more bass, and depth and the shape of the headphones makes them very comfortable. Normally I can only stand in-ear headphones for around 5-10 minutes before they become unbearable, but these I can listen to for long periods of time and still be comfortable.", "After 45 minutes of &#34;breaking in&#34; they're a great pair, they arrived fast and so far work well!", "Can't beat em", "I bought these headphones nearly a year ago, I think. They still work great. Awesome purchase for inexpensive headphones.", "They were working good up untill like a week ago. I usually run them through my back and through my belt loops on my pants when i ride my bike. When i go riding i notice that only one would work or it would make this light poping sound and would stop playng music all together. They sound really good you just have to take extra care of them. their really inexpesive so it wans't a big deal thet were nice while they lasted.", "I've been having these for 2 months or so and I give these ear  buds a 5 star rating.  They sound impressively good and clear. I previously owned some skull candy inked the cost me 35$ and I gotta  say these Panasonic are just as good,  once set  up with your devices equalizer these ear buds sound great.  That's pretty much it.  Cheap, durable, effective :)", "Hard finding a decent pair of headphones that don't cost an arm and a leg.  These are it, low cost great quality", "Earbuds. Sound comes out of them. Sound continues to come out of them to this day. Good buy! :)", "Great for the price.", "Best headphone for the money. Would by again if needing another one.", "I bought these has a backup pair of earbuds to keep in my suitcase/backpack in case I lose my primary pair of Urbanears. The sound quality is better than expected and I would say good enough for podcasts. The ear fit is really nice but the wires on these are super thin and it looks like the would be damaged quite easily if you used them full time. My biggest complaint in the theft proof packaging that arrive in. It's the kind that is going to crack and cut you while you try to wrestle the earbuds free. If they got rid of this ridiculous packaging for Amazon they could probably afford to make the wires a little more durable.", "Good sound quality. Not too much bass but it's there", "Sound will be just fine for anyone in the market for &lt;$10 earbuds.  Just make sure you use the appropriate fitting covers to get the best sound.  I had to use the largest ones that came with it.  I will say that the cord is a little too thin and too long (oddly enough) for my liking.  This results it excessive tangling.", "there ok but not much bass compared to the kasstino for the same price, and that one has a mic.", "Good quality, fast delivery.", "I usually don't write reviews, but this product completely blew my mind. I was just looking for cheap headphones, I didn't expect the amazing quality and design that Panasonic put in these headphones. The sound quality and comfort of the headphones is incredible for a product at this price! Talk about great consumer surplus!", "I love these headphones. I wear them running and they actually stay put. I've tried other more expensive headphones and they never seem to work out well. I thought I would try another cheap pair that had decent reviews and these work much better than expected. I can wear them for several hours and not have any problems. I've ran with them when it's really hot and when it's cold and they have always stayed put. I have ears on the smaller side and they still work well.", "Thank you these are really good! My teenagers ordered several sets because the quality is so good", "Cheap but decent headphones! Can't ask for more for the price. Sound quality is good in my opinion (my hearing isn't great though). We go through lots of headphones, it's nice to have a cheap option that works well!", "I must have weird ear canals, because for years I was resigned to the idea that I just couldn't use earbuds.  The old school, one-size hard plastic kind just never fit properly in my ears, were uncomfortable, and were constantly falling out.\nTimes have changed, and I'm thrilled to find that these fit and work great.  These fit more like earplugs, sitting snugly in the ear canal.  They come with three different sizes of molded plugs to accommodate different sized ears.  I wear them at the gym for extended periods and have had no issues with them becoming uncomfortable, coming loose, or falling out.\nI'm a musician and audio hobbyist, and have been very pleased with the sound quality.  I wouldn't likely use them for critical listening, but for travel or the gym they sound great.  And when (not if) I misplace them, they're cheap enough I can just pick up another pear.", "Don't get me wrong, the sound quality is beyond amazing and they are very comfortable! However the wires have a design flaw..from the plug that goes into your phone up to the point closer to the ear buds there are 2 wires and they easily get separated leaving a gigantic tangled mess. If you hate things getting tangled, look for other ear buds, but if you don't mind the hassle than these have great sound!", "Plastic part behind the rubber earpiece is too large for my ears and starts to hurt after a few hours of wearing them.", "Its percect", "Great for the price with decent sound.", "perfect - thanks", "You can not beat the price on these.  I do not buy expensive ear buds because I either loose or break them some how.  The sound quality is pretty good, and the price is amazing.  Over the past several years I have probably purchased like ten of these things not because they break easily, but things like dropping weights on them in the gym, or getting them caught in my bicycle spokes, or wearing them in the rain which most times they still work after I am careless.  I end up buying new ones because I end up losing them.", "For the price they really good.", "Absolutely love the sound out of these set.  I lost my expensive Klipsch set and was hesitant to buy this inexpensive set.  BEST PURCHASE EVER! They sound even better than my old one  Will definitely buy again.... Although I hope this guys won't get lost at all.", "I can clearly hear audios and music in this pair of earphones.", "The other reviews are all true, these really are unbelievable for the price. They are not Shure or other audiophile brand headphones, but they are definitely stellar for the price. I found I liked the largest headphone rubber ends the best, they sealed out surrounding sounds and had the most bass. These have decent bass, a lot of treble, and fair midrange, bordering on muddy. I have no idea how to find a pair of decent earbuds that don't have muddy midrange, but I'm assuming I'm just going to have to spend as much money as my studio over the ear headphones, unfortunately. I plan on picking up some Comply brand tips for these, I just feel like foam would be more comfortable. Protip for the rubber tips though, I put a dab of blue threadlocker / loctite around the ring and slipped them on, spinning them slowly. Hopefully this will keep the tips locked in tight, but still removable eventually. Another upside of these, when you remove the rubber tips, the actual speaker stem is oblong instead of round, so they keep the tips on a lot better than round ends. Overall, for this price, you can't go wrong to try these. I was a bit skeptical about the reviews, but they really do sound extremely good for the price, and keep outside sound out.", "These earbuds are AMAZING and for UNDER $10?? You CANNOT go wrong here! These earbuds have high ratings for a reason! I wasn't sure how awesome these were going to be when I ordered them, judging from the reviews, I figured they would be good but they blew my mind! These are fantastic! And for this price, I don't imagine you could get much better! They have a nice clear and crisp sound with some really really nice bass. I will put it to you this way.. If you are a dubstep fan, you probably know Bass Cannon by Flux Pavilion.. they can handle it!!! That song has some really loud parts and strong bass sections, the earbuds don't crackle or distort, they give really nice sound. I was listening to it at about 75% volume and it was super loud and super crisp, no reason to turn it up any louder. Another song with really nice underlying bass is Afterglow by Phaeleh, and for those that know it, you know what I'm talking about and these headphones make it sound phenomenal! Not to mention they do a pretty good job and blocking out ambient noise.\nSome key features of these earbuds are, they are lightweight, have an ergofit design, come in lots of colors, and they feature a 3.6ft cord. One negative thing I would have to say is about the cord.. it tangles VERY easy, but most earbuds do tangle so it's not worth knocking a star off in my opinion.\nWhen you buy these earbuds, you will receive the buds with three included sets of earpads (S/M/L) for a custom, and comfortable fit. MAKE SURE you try all three while listening to music. Pick the one that makes the music sound the best to YOUR ears, the better you can hear the better the fit is, so I've found. I originally thought I would need to use the smallest ones, but the sound I could hear out of the medium was better than the sound from the small, meaning the small wasn't fitting just right. So ultimately I went with the medium. It is important that you spend some time choosing the right size because by picking the right size you maximize bass quality.\nI use these headphones on my &#34;running sunglasses&#34; rig (picture attached) and they sound amazing and they don't fall out while I walk, run, or bike. They were the perfect choice for me for this setup I have. For anyone who wants to try what I've done, I am using these sunglasses: \nRockBros Polarized Cycling Glasses Sports Glasses Sunglasses Goggles\n, and an iPod shuffle 2GB (4th Generation).\nOverall the earbuds were perfect for my needs. I bought them mainly because they were so cheap and I figured if they get messed up while exercising it shouldn't be a huge deal. It's safe to say they exceeding my expectations by a long shot and if you're on the fence about these for whatever reason, don't be. They are fantastic little earbuds and you will not be disappointed with your purchase!\nIf you have any questions about this product, feel free to ask me and I will answer to the best of my knowledge! And if this review was helpful to you, please consider leaving a positive rating!", "Fit great, no more headaches from cheap headphones. I just rotate them around until they are comfy.", "I've had these a couple months now and they have been wonderful. The sound quality is amazing and is great all around", "It was a gift and by baby sister loved them.", "So so", "Great sound quality. Arrived promplty. Great buy,", "My son uses these. They work wonderfully. Sound quality is great and both sides work consistently! I purchased a couple of replacements only because my son doesn't take care of his things and lost a pair and broke a pair.", "Best ear phones ever. I love that it comes with different size ear pieces to accommodate how big or small the opening of your ears are. Sound is awesome. I have purchased a few of these exact pairs whenever I lose my other ones.", "The quality is good but I don't like having the earbuds come out to the side. They aren't that comfortable to wear. I wouldn't get these again", "Whoah! What a nice earbuds very comfortable and great sound, very recommended", "These are really good... Just one thing... I lost them!!!", "Thanks", "They were good, but like most headphones, they stopped working in one ear before completely breaking. It lasted a good 6 months though. Definitely worth buying.", "Great quality, great price, sound ok-ish.\nFeels a little fragile -- always have to take care I don't break the wires.", "Awesome earpods.", "Good", "Great set for the price.  buy it.", "The plug in is not universal so it can't properly connect to my phone because of my phone case. But the headphones are good", "good", "Let me start off by saying that since I was a kid portable media has been as attached to me as my big toe. I have gone through hundreds of earphones of every style and brand ( i cant substantiate this claim). I have tried in the ear, over the ear, over the neck behind the neck, waterproof,bluetooth analog etc. I have even had custom ear pieces made by my dad who worked at a store that built hearing aids. of all the headphones I have tried these come second. first would be the noise canceling over the ear BOSE headset. Those are wonderful but come on at 300 dollars they better be. So these come in second but at a 5 dollar price tag that is saying something. They come with 3 different sizes so they should fit pretty much anyone. I have used it at all times of the day with varied products and I am satisfied with them in all instances. My favorite thing to pair this with is \nMpow Streambot Mini Bluetooth 4.0 Receiver A2DP Wireless Adapter for Home Audio Music Streaming Sound System  & Bluetooth Car Kits with 3.5 mm Stereo Output for Smartphones & Tablets\n you get bluetooth with good sound and not all the cost and is more customizable.I have used this setup while sleeping, i didnt hear any outside noise or get ear infections or anything like it.I cant say enough good about it.", "Very very good", "Excellent value for these headphones! The sound is very good, they are comfortable, and they hold up well. I have ordered them before and I will likely order them again. Easy 5 stars from me!", "My favorite headphones.  The earbud is slightly off from the wire part, a little hard to describe, but in my opinion it helps fit better in my ears.  I have smaller ears so I usually have a problem finding headphones that fit right, don't hurt after a few hours or that don't fall out.  These haven't had any of those problems for me.  I also love they are pink...makes them so easy to find!  I prefer these to the iPhone 6s plugs that were included. I've used it on my iPad, iPhone 6s and iPhone 4.  The sound is very clear.", "Awesome value.", "Do not work with the iphone.", "does the job", "A little difficult to keep these in the ears at times, sound is pretty good though.", "Little bass ,Sounds poor !!!!", "These work great. Nice price, nice sound. Nice color too. I use them to listen to podcasts, so I can't comment on how good they are for music.\nI like the fact that there are three different earbud cover sizes to choose from, because I find the large and medium ones uncomfortable. These are a replacement, since dog chewed last pair. I guess earwax is...tasty!", "survived a wash and dryer cycle", "These lasted exactly 10 days before the right earbud stopped producing sound. I guess you get what you pay for.", "Comfortable, good sound.", "is  so  good", "Really like them! Very good for the price!", "Nice earphones, my son stopped borrowing my pair, I guess he is o happy with using them", "Review is based on the cost. Probably the best quality i have heard from a cheap earbud. great value for money. Only complaint is the feel is a bit cheap", "Got the black one first. It lasted for 5 months. Bought the white one as a replacement. Only lasten for a month. Both of them have issues on the stem near the plug. I suggest putting duct tape on the stem to reinforce it. Sound quality is on point though.", "These sound very good for the price", "GREAT headphones for the price, and great to go running with/exercise with. It shuts off the outside noise pretty well, too!", "The best six buck earbuds I've ever used. Did a lot of research before buying, most earbuds this cheap are garbage...these are good. They are better than lots of more expensive buds...", "These sound amazingly good for the price and never get tangled. Perfect throwaway pair to stick in a bag or pocket.", "They last forever and play music and for the price, very worth it. Mine usually last about a year since I take care of my headphones, I also use them A LOT.", "These earbuds shocked me from the time that I had bought them. After my apple earpods had failed (for the 3rd time), I decided to move on to something else. While browsing the earbud selection on amazon, I came across these uber-inexpensive earbuds, and thought that I had to give them a try. One should not make a large investment in earbuds because they break easily and can get lost due to their size, but these are the best earbuds I have ever owned (in terms of lasting) even over my bose earbuds. 6 months and still pulling strong! Yes, the sound quality does not top the best brands, but these earbuds are really great. One con is that these earbuds do not include a mic/remote, but who can complain when you are talking about $6 earbuds! I would definitely recommend these to people who do not have good experiences with earbuds and who are on a tight budget.", "High quality earphones for less! will surely buy another one next week.. great gift for my brother.", "Love it", "No bass. Should of gone with skull candy", "Arrived on time, purchased for a friend who did not use the item.", "Well worth the $. Work well and I agree with other more in depth reviewers about this product.", "Great quality for the price. It is not a bose sound but it is sturdy and the cord won;t broke at the plug as often happens with lower quality earbuds.", "None", "This is (at least) the 3rd pair of these headphones I have purchased and I am sure I'll be back for more.  I have a nasty habit of losing them or sending them through the washing machine so I just cant justify spending $50+ on the higher end pairs that to my untrained ear, really don't sound any better.  These are comfortable and include 3 sizes of covers so they will fit just about anyone", "cheap and so good in sound quality!", "Great value and good quality headset.", "GREAT sound for tiny ear buds.  Very comfortable too.", "Wow! For a cheap price these earphones are the best I've had. Even better than the beats I had which broke a month later.", "The shape of these headphones are wonderful! I have a very obscure inner ear shape (lol) and NO other headphone besides the apple ones are comfortable, but these are comparable. No slipping. The wire is a bit flimsy and when the jack is being moved around you can hear a bit of static but it's $6 so I can deal. Great for the price!", "None"]