["Honest review!", "love me some Haribo", "Haribo or nothing!", "The best", "Gummi bears are great - - - this is 5 pounds of greatness", "Trick gone wrong...", "Life changing!!!", "Yummy. I finished it all by myself. Only ...", "Five Stars", "Not sugarfree", "Bears never tasted so good", "Five Stars", "Good if you are just looking for the regular ones", "Devil Bears", "Five Stars", "I don't see how it could be better!", "sweet and chewy", "You'll hate gummy bears after buying these", "Five Stars", "The classic is still my favorite!", "Five Stars", "The Very Best You Can Buy!  Fresh and fruity, soft and chewy little bites of goodness you can't resist!", "Great gift", "Four Stars", "One Star", "Five Stars", "One Star", "I bought the massive bag of explosive candy for my ...", "so chewable", "Four Stars", "Five Stars", "death, don't know now if i will even get married.", "Gummi bear poem", "Five Stars", "Five Stars", "This is the perfect gift for an ex", "The comments LMAO", "I mean, what more can you say other than ...", "Five Stars", "Five Stars", "May God Have Mercy.", "Five Stars", "Haribo are delicious!", "as it looks like an \"unofficial\" package", "Excellent! Hard to stop eating the little bears", "Five Stars", "Five Stars", "Delicious and these are not the sugar alcohol ones", "My life is ruined", "Three Stars", "Good vlule and good candy", "YUM", "will be done eating next year", "Five Stars", "purchased a \"3 wolf howling at the moon shirt\". ...", "Addictive and wonderful!", "Three Stars", "Five Stars", "Five Stars", "addicted to its taste", "Side effects may include anal leakage", "Five Stars", "Three Stars", "If you like gummy bears", "Love these", "Love", "Five Stars", "Food for days", "Absolutely love these things", "One Star", "I hate you so much imgur. Like imgur and 9gag. Like imgur and other imgurians", "Makes nice Christmas gifts", "I am currently having Vietnam flash backs with these gummy bears.", "Good Stuff Manard!!", "So delicious", "the only brand my kids love", "LOVE THEM.", "gives distinct gummy flavors", "Triple Threat", "warning", "Five Stars", "Five Stars", "Five Stars", "Yummy gummies!", "ANUS OBLITERATION", "they love it.", "won't let a day without any gummies", "Ignore the joke review. These are NOT sugar free gummis and they do NOT contain maltitol, which is the problem ingredient.", "Gummy addict", "Gummy lovers unite", "These are awesome. Great flavor", "OMFG, amazing!!!", "Five Stars", "Doesn't Look much like Bears", "Our families favorite candy", "Five Stars", "Four Stars", "Five Stars", "Haribo's my total go-to for sweet still, since discovering them in the 1980s Thanks ...", "10/10 would buy again", "Five Stars", "can't stop eating these gummies!", "ASS GOES BOOM", "The burnn...", "Five Stars", "and I love it too.", "I didn't s*** my pants!!!", "Five Stars", "Fresh and on time", "Five Stars", "Stay away!", "what is there not to like?", "Five Stars", "Five Stars", "These are my favorite poison pills.", "Yumm yumm yumm BIG bag of my favorite gummies", "Five Stars", "love em", "Five Stars", "Five Stars", "The very best gummy bears", "My girlfriend loved it.", "Gummy bear lover??", "I LOVE gummy bears and believe that folks somehow have weak ...", "Five Stars", "Worst gummies ever", "Five Stars", "Classic", "Don't take to public events", "It's a great deal!", "Helped satisfy a pregnant wife's cravings", "School kids & Adult kids love 'em.", "Five Stars", "Very good and very fresh", "Five Stars", "Fantastic", "G&Uuml;D", "The gummy bears weren't stuck together like the one photo I saw", "Five Stars", "Five Stars", "Five Stars", "They really love gummy bears so it was the perfect gift and ...", "Sugar-free and regular, not the same", "Not nutritious, but delicious", "good (sorry for bad english)", "Five Stars", "Great for baby shower", "Fresh and Fast", "Awesome", "Five Stars", "So Hard to Put This Bag Down Once You Pick It Up", "Not too sweet, but a good amount to be sent to coworkers", "One Star", "My favorites", "I need some wd-40...", "Five Stars", "Five Stars", "Delicious devil bears", "Five Stars", "they were very good!", "Good", "Five Stars", "The pain in my abdominals literally felt like someone made a small incision in the lower right ...", "These will not harm you, they are simply delicious.", "Five Stars", "BEWARE - These Disappear!", "Must limit to one handful.... nomnomonomonom", "I love these gummy candies!", "I LOVE CANDY!", "just the right sweetness.", "NOT KOSHER like previous ones from Turkey", "Clinical grade colon cleanser 5 stars... delightful gummy snack 0 stars", "It is THE BLOB", "Five Stars", "Five Stars", "YOU WILL SHART!", "Love these", "I love these gummy bears", "Who doesn't love gummi bears?", "", "These are the worst. They came hard as rocks and went straight ...", "The Invasion of the Satanic Poos", "Gummies", "Five Stars", "Four Stars", "Thought I only loved Bears", "As expected. Fresh and delicious.", "Stale Gummies", "we love our gummies", "Who needs laxatives? These little devils will make your ...", "I am now a man of God", "Five Stars", "\u001a", "Only slightly more costly than aquarium gravel. A great deal", "I guess the non diabetics don't know that anything sugar ...", "Five Stars", "Taco bell", "Five Stars", "5LBs of Wonderful", "Why do they make these!!!! A ...", "Was heavier than description, very satisfied!", "Haribo gummy bears are the best gummy bears on the planet. Hands-down. I'll put any of these chewy treats up against black Forest gummy bears any day of the week.  They'vegot nothing on my Haribo.  I put these in my office and they are gone almost immediately.", "Just as described, a HUGE bag! definitely worth it if you love gummi bears and won't settle for less than Haribo.", "Product as advertising. It was very fun to make.", "Gummi bears are great - - - 5 pounds of gummi bears are even greater!\nSame great gummis in an almost bottomless bag.", "I bought these to try and trick my buddy into having explosive diarrhea...They didn't do the job. They are the wrong ones...", "Wow, where do I start! I bought this product not expecting much but a few gummi bears. Boy was I wrong!!! These crazy little gummi bears come supercharged with insane qualities. As soon as I opened the bag I put these bears to work. I sent a few out to do my laundry, clean my house, pick up some groceries. Some of these gummi bears bring decades of business experience and are well educated (Harvard,Yale,Columbia,Princeton to name a few). Needless to say I'm now sitting back getting fat off these gummi bears. Just be careful of the green gummi bears, they drink to much and don't show up to work on time. I ate them first for that reason. All in all I would buy this product again.", "Yummy.  I finished it all by myself.  Only took 2 months.", "I ate the whole bag!", "Still awesome though!  Can't go wrong", "They taste like gummy bears.  Very delicious", "I love these", "Was hoping to get the sugar free gummies. Searched for those.  These came up.  They are not the sugar free kind.  Good if you are just looking for the regular ones.", "I decided to give this to my best friend for her birthday, since she has a sweet tooth. I thought the five pound bag would be enough, but I was wrong.\n  I gave her the gummy bears and she opened them right away. We began to eat about a handful of them until our stomachs groaned. I thought I would throw up, so I raced to the bathroom. She raced after me, I thought that she also was going to throw up. I was wrong of course and it felt like a water fall crashing into a wall. I body slammed her out of the bathroom and gathered two rolls of toilet paper, getting ready. I spent two and a half hours in the can. Luckily there were two bathrooms in the house, but I had forgotten to restock the toilet paper. With only half a roll of toilet paper, she survived until I could bring more paper. We spent all night cleaning out our systems while taking a series of handfuls of Tums.\n  Two days later, we were clean and clear and I took the devil gummies to my work and fed them to my strict boss, who hates me. I silently watched as he also shoved handfuls of gummy bears into his mouth, then raced like a bear was chasing him until he reached the bathroom. I would only use these gummy bears for payback or to get fired from your job.", "Very yummy tasting and comes in a 5lb bag!!!", "It's 5 pounds of gummy bears, I don't see how it could be better!", "I will never get tired of eating panda bears. It's so sweet and chewy!", "You'll hate gummy bears after buying these, there are soooooo manyyy.  They were fresh upon arrival and remained so until they were opened today on Christmas (a few weeks).  Only thing is they were a bit melted together when I first received them from the post man.", "Yummmmmm", "Yummy!  The classic is still my favorite!", "Be careful, these can bite (not while in your mouth)", "Beware, these are addicting.  They are the very BEST gummy bears you can buy Anywhere.  I have to have these around at all times.  I simply crave them.  I don't like chocolate but I sure do love the fresh, fruity, soft and chewy little bites of goodness in these Gummy Bears.  If you are a fan of Gummy Bears, you have to try these.  The only smart thing to do is to buy them in the 5 lb. bag.  Kids love them, even old kids like me.", "Exactly as expected. Makes a great gift for people that are hard to shop for!", "Bit pricey but a TON of tasty little gummies.", "Worst knock-off ever!  This should not be sold at all!", "Great price for stocking stuffer!", "Said they were sugar free and were not", "I bought the massive bag of explosive candy for my dearest friend who loves Gummy Bears. I bought it as a Christmas gift.  It currently sits wrapped under my tree waiting for the right moment to give it to my dear unsuspecting friend of the turmoil that follows eating this bag of gummys. As the evil in me tends to creep out from time to time it really did with this purchase.", "Chewing gummy bears is my favorite pastime.", "Good and good price.", "How do I stop eating them? Do they run out or do I die or what?", "i give this a five star ratting for the idea in my mind of giving these to my soon to be father in law. As you can see in your mind that didn't go well, but it was a laugh for me at least. It all started on a nice forth of July with the family, when i got a gift for my father in law, when he opened the 5 pound bag of bear he was happy,(ps.  that was at 2:20pm we left at 11:45pm) so all day he ate the bears, when i heard the LOUDEST  SOUND coming from my father in law it sounded like a Dinosaur was about to die and screaming to death, it was a fart!!!!!!!!!!!! everyone looked at him probably also the people from the other side of the world. Then he ran like his worst nightmear was chasing him!\nwhen he cam out the fireworks were over but his farts weren't. we left right when he left the bathroom. then the next weekend we got a call from my  soon to be mother in law  and she said the my father in law was in the bathroom crying and screaming all week long. So in other words don't get these unless you want to die, or play a prank on some one, ps, i was never asked to bring gifts on any holiday ever again.", "I had tried all the candy at the store, eating familiar candy is such a bore. So I went in search of candy galore, I wanted not the candy store... I wanted more. Going to the store is such a chore, but online they deliver it to your door. So here I went to search for candy galore. You'll be happy to know my attempts did not fail, for here I found my holy grail. More candy ever owned by the store, my sweet tooth needed sorrow never more. My heart raced like hunting hounds when I found a bag of bears, 5 pounds!!! I thought I was having a lovely dream when they were only $12.14. They are on prime, they'll be here soon! I am so excited, I just might swoon!", "Soo yummy they came in super quickly \u001a", "5lb pound bag of gummies. Arrived on time and tasted fresh and chewy!", "This is the perfect gift for an ex,heck get them two,but send them anonymously,and hope they never find out who their generous gift came from.", "No need to even buy these. The reviews are even better than the actual product", "I mean, what more can you say other than it's a 5 pound bag of gummi bears... They tend to go fast when people see how many you have, so split the bag just to keep some for later... LOL...", "Hella bears! YUMMY!", "Fresh and delicious!", "Whatever it is that I did dear Lord, I am truly sorry that I did it. Whatever I did not confess before must've brought this upon me, only an extremely sinful act could create such trauma and misfortune in my life...\nIt is currently 11:12 PM, December 15th, 2015. Whoever is reading this, please, if you have any goodness in you, burn these Satanistic hell bears, for they have burned me. I am in Hell.\nNow it is 11:14. I spent the last two minutes praying to anyone who would listen. I prayed that no human being in the world have to go through this thing, this unreal event that I am experiencing. For if you did somehow survive this fallout, you would never be the same.\nIt's 11:16. I am trying to imagine what kind of Satan ingredient the workers at the Hellish Haribo Factory put in these bastard bears. It could anything. Heart of Hell Hound, goat esophagus, Hell it could even be one of Satan's testicles.\nIt's 11:19 and I have reached a new stage of my undoing. My muscles have given into the Beast and my brain is no longer in control. It started with minor spasms in my buttocks, not unlike the ones caused directly from the demonic gummies. Then it spread to my face, my eyebrows were twitching, no, not in constipation, but in fear for what was to come next. The spasming fell down my body to my feet. I found my innocent feet tapping to the beat of 'Wrong Side of Heaven\". If only they knew what was happening a mere two feet above them. Lastly, my arms started to move uncontrollably, my hands gripped my neck as if to choke me to death, to end the misery and the suffering. Why did I resist? When I squirmed out of my own hands grasp, they stopped and laid still, that was my only chance out. I am merely a spectator now, a puppet. Satan himself is my puppeteer.\nIt's 11:23. There is now more human essence in this porcelain bowl I suffer on then there is in me all together. I have created another human being in this toilet from digested food and the life-ending bears. I am now half-standing, half-squatting, the essence is overflowing the bowl and no matter how many times I swiftly reach back for the flusher and push it down, more essence replaces the essence that is leaving to join its kind down in the depths of Hell. The floor is starting to become tainted with feces and I am put to the true test. I stand sadly in a puddle of my own feces. The flow will never stop.\n11:27. Something is changing, for any of you still reading this. The flow has slowed to a mere trickle. To me now, this is the idea of a Heaven. I flush the essence away and sit down comfortably on the caked bowl. Now only a trickle fills the toilet, which gives me some time to recall the events of tonight. I should never have ate those damned bears. But things are looking up, I might make it out of this. Thank you dear God for shining your love upon me.\n11:31. I hear a noise. It's the sound that you associate with a coughing chain smoker, it sounds like a mix of a rusty train horn and a big cat growling. The noise is coming from the depths of the porcelain piping. I quiver in fear and remain silent. A tear rolls down my eye. This noise reminds me of the first battlecry the little bears shouted as the breached the port of my buttocks. I clench my entire body, waiting for the volcanic matter to flood upon my bathroom floor. Nothing happens. I throw up in over excitement. All is good again. I am comfortable. God has shown his grace on me.\n11:40. Hello there dedicated historian who is only reading this to study the Era of Hell Bear. I have lived. My next step is to stand up, a thing I thought I would never do again. I make my attempt at moving past the events of the recent hour.\nTHIS IS A DESCRIPTION OF THE FOOTAGE CAUGHT ON THE SECURITY CAMERA IN MR. CAPO'S RESTROOM.\nThe victim shakily stands up to reach the toilet paper and as he does, something green, brown, and smooth flies up from the white and brown bowl.\nThe next events can only be explained as Satan's doing.\nThis s*** demon grabs the victim and clutches him in his water grasp. We watch as the victim tries to squirm away, like a mouse in the grasp of a cat who is not done playing yet. We observe tears flowing down the eyes of the victim.\nThe monster has decided playtime is over. The victim helplessly retaliates against the Beast. He kicks and screams, shouts to God for mercy and shouts to Satan for him to stop playing his chess game. No one responds.\nThe feces mutant swiftly uses its incredible force to snap the limbs of its new dinner. Our victim screams in pain. The Poop Demon does this to every limb, leaving the victim motionless. But the victim is not dead yet. Nor will he ever be. His mind, dead or alive, will always be trapped behind the Gates of Hell. For what he has seen and experienced  can never leave someone. Even if their heart stops beating. He will remember.\nWithout waiting any longer, Satan's s*** demon sucks himself and the victim back into the toilet, leaving us here behind the security camera, speechless.\nMR. CAPO'S BODY HAS NOT BEEN FOUND AFTER THE EVENTS OF HIS JOURNAL ENTRIES AND OUR OBSERVATIONS VIA HIS SECURITY CAMERA.\nBUT HIS BODY IS ONLY ONE OF THE BILLIONS OF PEOPLE WHO HAVE BEEN SUCKED AWAY INTO FECES HELL. THERE ARE ONLY 73 MILLION PEOPLE LEFT ALIVE ON EARTH. THISE BEING THE ONES WHO HAVE HIDDEN FROM THESE MONSTERA WHO NOW ROAM OUR CITIES, OUR STREETS, AND EVEN OUR HOMES.\nLASTLY, MAY GOD HAVE MERCY, OR ELSE THE S*** DEMONS AND SATAN HIMSELF WILL BE THE ONLY LIVING THINGS WALKING ON THIS PLANET.", "YUMMY", "I love Haribo!", "Exactly what you'd expect - a GIANT bag of Haribo gold bears.  I was a little skeptical of buying this product, as it looks like an &#34;unofficial&#34; package, and I didn't know if they'd be fresh or not.  If you're also looking at this option, rest assured knowing that these are in fact authentic and were super fresh.  I'll order them again.", "Excellent!  Hard to stop eating the little bears.", "Fresh and fabulous, quicker than expected ship, will be buying these again!", "good", "Delicious  and these are not the sugar alcohol ones", "I work for a large company.  We had a secret Santa thing for Christmas.  I pulled the one guy I hated in the office, so naturally I wanted him to suffer, because I'm an awful person.  So I get these along with his favorite sports mug for presentation.  He opened the package and immediately popped a hand full into his mouth.  Moments later his bald head was glistening with a fine coat of sweat and his stomach was making sounds not heard since the shooting of The Exorcist.  Standing across the room I was casually watching as he was just starting with a customer and couldn't excuse himself.  Moments later he doubled over hitting his head on the desk, knocking himself out as his bowels evacuated through his Dockers.  Shooting a fine spray of what I can only assume is a mix of plasma, hellfire, and skunk musk not I my on the wall but the 3 coworkers next to him.  They each in turn stared in shock as they were coated with a mist of evil. Then the smell hit causing a chain reaction of vomiting eerily similar to the pie contest in Stand By Me.  Soon customers and employees alike were projectile vomiting.  Long story short I have to change some details for legal reasons, but I'm up on attempted murder with a WMD, several counts of aggravated assault from the spray and vomit fight, and he is in a coma from hitting his head... So it's not all bad.", "not too much flavor", "Good taste and good value.  Will purchase again.", "Best gummy bears in the world! 5lb bag makes life better. Keep them in a Tupperware and they're fresh as ever for as long as you need. :)", "This bag contains 5 pounds of gummy bears that I think I'll be done eating at the end of the year.", "so much cheaper and taste the same!!!", "purchased a &#34;3 wolf howling at the moon shirt&#34;. ate a five pound bag of these lil fellas........farted 2 times, end of story.", "My sugar fix without all the calories and guilt.  Addictive and wonderful!", "wasn't the sugar free ones that i ordered.", "YUMMM. There Gummy Bears, need I say more.", "diabetes inc", "If this pack of gummy bears is a drug, I think I need to go to the rehab, because I'm super addicted to its taste.", "These little bas%!@ds are delicious! They are soft just like the real thing and have great flavor. That being said, about an hour and a half after I was done eating about 50 of these things, the tummy growling began, a noise so disruptive, it could only be compared to that of an angry dog getting its bone taken away. Next came the churning that even Laura Ingle would be impressed with. These things had me running faster than a Kenyan to the toilet shortly there after. As I sat in agony for an excruciatingly long period of time on the john with boiling hot lava spewing from my arse, I wondered to myself (and out loud) why someone would make such an awful product. I came to the only logical conclusion, it is really really funny if it isn't you that has eaten them. I prayed to the porcelain gods that the bowl had enough room for all of my gummy bear goo. No courtesy flush could get rid of the stink festering in that bathroom. It took almost a full day for my butt to stop burning. Great to give as gifts to your ex, crummy co-workers, and anyone else you deem fit to have their day ruined, and possibly their outfit.", "Best gummy bears.  Good seller.", "Flavors aren't as good.", "THIS PRODUCT IS NOT SUGAR FREE. THIS PRODUCT HAS SUGAR AND CORN SYRUP FOR SWEETENERS.\n*cough\nAnyway. If you like gummy bears, and eat a lot, you probably already know Haribo is some of the best on the market. You'll also notice that this is like, 3 bucks a pound. If you know you're going to go through this many gummy bears anyway (or you're serving a party), then this is ideal. Kind of wish they had a resealable bag, but meh.", "I love the multiple flavored candy! It is really very inexpensive?3", "Nom nom nom", "These were a hit with my students!", "5 pounds lasts a long long time for one person.", "Absolutely love these things, although my dog did too, she ate about 2 handfuls then threw up ( thank god they were not the sugar free )..", "Bag was broken when it arrived and they were hard as rocks", "Amazing bag gummy bears. My stomach may not agree but it's not he can do anything about it haha. I hate you imgur so much. Why did you have to mess with my bears. Double the price now :/ fellow imgurian here still munching away on my lil death bears", "Perfect as always, I purchased this large bag so l I can divide this up into enough portions to fit into about 25 small clear decorated plastic boxes so I can give them as christmas treats for my adult students.", "It was another great day to live with the thought of a higher being watching over me, woke up, ate some raised Bran, then I remembered in the middle of my breakfast, I ordered so Adorable, delicious little gummies bears, I ran to my mail box, and there they were, looking yummy as ever, I went back inside and there was about another hour until church, so I decided to snack on this little bears, I didn't even notice I ate the whole bag, and right around that time I had about 35 minutes until church, I took a shower, and I was on my way finally to church. While I was in the car I heard a faint cry from these little b*srerds I proceeded to drive. I say done in church a few minutes later and the priest started preaching. Then I heard it, the faint battle cry of the Ani-Crist ripping through my intestines like the Grand Rapids. My Sphincher buckled up, ready for the full force of the hell I was about to be brought to, I prayed to God for my self to ATLEAST make it to the bathroom. I jumped up like a desert rabbit, hurdling over people like an Olympian to the bathroom. I finally got to the bathroom, as soon as I rested my cheeks to the toilet, I them prepared for the hell I was about to bring into this world. The feces ripped through my Sphincher like the howling winds of the sacara dessert, ripping through my colon screaming &#34;SPARRRTAAAAAA&#34; popping, and snapping that could be Hurd from the tallest buildings of Chicago, diarea spilled out of my rear end like a pull that's has been stabbed on the side. I was imagaing satans head poking out of my poor ass.i am currently a mink in the Nepal mountains, never to be seen eating candy again. God bless my intestines....", "A perfect snack, for me, instead of cookies and cakes.", "I like the containers that the gummy bears come in. Keeps them fresh and soft. Can easily reuse the container when you are finished.", "It's the only brand of gummy bears that my kids love to eat.", "I share these at work and buy bag, after bag, after bag.  LOVE THEM.", "It's the only brand of gummy bears that I love. It just provides distinct gummy flavors among others.", "I ordered this lovely gummies for my son. We were on an adventure to Dick's Sporting Goods,I was looking for a T-Shirt. We were looking at the amazing selection when my little boy decided to release the satan bears and chew them to goo his face lit up with emotion and i wanted to see what those bears had done to my son. I took a hand full, foolishly chucking it down my throat. Not even a full 10 minutes it hit me. All i knew was i'm the bomb and i'm about to blow up. I rushed to the nearest facility and sat down then...hell broke loose. As i sat there releasing satan's minions i realized what happened to my son?", "Should be a warning not to eat this deliciousness in one sitting.", "nice product, thanks", "YUMMY!!!!", "Do not eat in one sitting.\nWe ordered 4 of this and managed to build 200 goodie bags", "Enough gummies for a whole year!", "it was a sunny Sunday afternoon. I decided to eat the whole bad of gummy bears. It was not so sunny afterward. The diarrhea hit while I was still on my couch. It destroyed my rectum as it exploded everywhere. I ran to the toilet. A stream of feces spewing behind me. Two weeks later I woke up in the hospital. I saw a tube with thick brown liquid flowing out. My Anus was on fire as if the dark lord ctulhu was living in my sphincter. I am currently in quarantine. By the time u read this my town will likely be a lake of crap. Five stars", "According to my 3 year old niece and 5 year old nephew, they love it.", "I won't let a day without eating these colorful gummy bears. I feel like in cloud nine whenever I eat it, because it's my stress reliever.", "These gummi bears are the real deal and they're fantastic.Great flavor, great chewiness. And no, they don't cause diarrhea because they're not the sugar free variety.", "I can't believe I ate the whole bag.", "I'm a gummy bear lover so once it came in the mail I was done. No other words needed.", "Right on!  These are awesome.  Great flavor, Great toughness.  Not for the lazy folks that want to chomp twice and swallow.  These remind me of the gummy bears I got as a kid at the mall.  Love them.  Ordering more.", "Let me just say. 1. I loved this, probably one of the best ways to spend my money. 2all the other reviews of it giving the runs. They weren't wrong. After eating the entire bag in 4 days at the end of the 4th I had to go to the bathroom. And I had a bit more than just take a dump.\nloved it", "brought a smile to grandaughters face", "This is VERY tasty. I can't get enough of these Gummy Bears. They're so sweet that once I started eating them I couldn't stop. The flavor is awesome. Why didn't I give it five stars then? Because even though the taste is out of this world, they don't look very much like bears like they're supposed to. I can't make out the shape very much, even with holding it up towards the light.", "The Gummies were just as described and delivered on time. Our families favorite. Thank you!", "Exactly as described; 5 pounds of delicious gummi bears!", "All of the reviews below are true.", "excellent value", "No gummy bear compares to the beloved original. Haribo's my total go-to for sweet still, since discovering them in the 1980s\nThanks for such quick service!", "honestly its not as bad as some of the reviews made it out to be i only had to stay in the hospital for a week after eating the entire bag in 4 hours", "Love it!thanks", "I can't stop eating this gummy candy that's why I bought this 5-pound bag. I would like to see when will this bag last in me.", "MY ASS IS STILL EXPLODING! DAMNIT WHY DID I EAT THE WHOLE FRICKEN BAG!", "I had massive diahrrea, but it was totally worth it!(:", "Got these for my son's birthday. He can't get enough of these.", "I never thought I'd still come across these gummi bears after a very long time, in a place so unexpected. I wanna cry. It's just so beautiful. and I love it too.", "These aren't the sugar free ones. They're safe.", "Yum.", "These came exactly on time, and they were extremely fresh when we opened the bag. They also stayed fresh in an air tight container for about a month (which is when they were finished up).", "Best buy.\n Ever.", "Unless you want to feel like someone is stabbing you in the stomach and feel the burning while it comes out. They taste yummy but not worth it.", "5lbs of gummi bears... what is there not to like?", "Awesome", "Good tasting candies.", "I am offended that these don't have a country named after them. It could be called &#34;If you buy these your butt won't be disappointed&#34;", "My gummies arrived fast and fresh.  It's a really great value at $10 and some change. SUPER fresh.....much better than grocery store purchases of gummies. Good value.", "Yummy!", "delicious", "Great Flavor.", "I'm absolutely convinced the reviews are better than the product.", "Super yummy, fresh, as expected.", "It's just as expected. My girlfriend loved it.", "This was a birthday gag gift for my 22yo son. He loves it!\nIt is truly 5lbs of gummy bears in a big bag.", "I have not laughed so hard in quite awhile. I LOVE gummy bears and believe that folks somehow have weak stomachs or ate so many it caused a sugar overdose which would lead to the reactions several folks posted. I purchase my large bags from Walmart for $7.99 and have not had the explosive reactions noted here.  Thanks for the information shared.", "Item was fantastic!!", "Haribro gummy bears are the most disgusting rock hard waste of spaces I've ever eaten ... I was so excited and happy because even makes a big deal about haribro gummys and I was finally gonna try them and after the first six I had determined they taste like absolute trash and a not &#34;gummy&#34; at all there little bastard rocks... But I thought maybe it was just the bag and bought some more from a local store and we'll just as trash :( not impressed", "Great item fast shipping....", "Classic gummies. I love them.", "Brought these to a Boy Scout event lets just say there were not enough bathrooms for 40 people to take a emergency dihreaha the church was closed for 1 month to re-Carpet an get the bathrooms clean.", "I buy these for my office candy jar. It's a great deal!", "Ok, my wife as pregnant when I bought this product.  Full disclosure by the time she realized she had a problem I thought she would give birth to a happy healthy...gummy bear.  We started off buying the little bags at Walgreens or Target.  After those were devoured in mere hours we moved to the economy bag, that I'm pretty sure are for classrooms or weddings.  Once those proved to be child's play for the gummy annihilator we had to search for a bulk alternative.  Thankfully there was Amazon, delivering this MASSIVE 5 pound bag of gummy's in 2 days.  I could time it to where it was on the door step as the final bears met their demise from the last bag.  I believe we only bought this once before she realized her teeth couldn't withstand the nightly torture, but good lord this bag was clutch.\nNo frills, no pleasantries on the bad, just 5 pounds of gummy bears and the ingredients stamped proudly on the front.  Thank god for Haribo...otherwise I don't think I would have lasted through this one!\nI am embarrassed to admit that I actually did research a quantity over 5 lbs...", "Wonderful flavor & allowed me to make up baggie treats at a lower price. Delivery was spot on", "like it....", "These are for my daughter and I need to order more.  Very good and very fresh.", "good", "It was a bright, sunny July day. 81 degrees Fahrenheit in Marietta, Georgia. As I awoke in the morning, I realized something. Today was the day. 6 years going strong and it was finally the day. Today was the day that I would lay the path for the rest of my life. The doorbell echoed throughout the house as I placed the rose in the chest pocket of my white tuxedo. Today was the day. I answered the door to find none other than my loving parents, baring gifts of many kinds. I had no time to open them all, but I gladly accepted the gift basket with open hands. As I surveyed the wonderful display of food, my eyes locked on one thing: Haribo Sugar-Free Gummi Bears. As we drove to the church where the ceremony was being held, I devoured the soft, flavor-packed angels they called candy. Life could not be going better. That is, until the ceremony. The words still ring through my mind. &#34;Do you, James Cameron Jenkins, take this man to be your lawfully wed husband, through sickness and through health...&#34;. Then it happened. As the small army of hellspawn charged through my bowls, devouring everything in their path, I knew, it was all over. My rectum stood no chance as the demons burst through my colon and rocketed out of my anus, all into the back of my paper-white tuxedo. My husband broke off the marriage and my family disinherited me. The state outlawed gay marriage the next week. My life was over. All thanks to the beautiful minds at Haribo.", "Better than Master Cleanse.", "The package came without rips or tears. The gummy bears weren't stuck together like the one photo I saw. They do come a bit more softer when they are first opened. I sorted them by color (most common: red &#62; green &#62; yellow &#62; orange &#62; clear) and froze them. Now the taste and texture are the same as when you buy the haribo gummy from the stores and freeze them", "Fresh!", "Five Stars!", "Great product arrived on time...", "Bought this for my two work buddies as a Christmas gift, bought some Tupperware and threw half in one and half in the other (minus a few sacrificed ones to me haha). They really love gummy bears so it was the perfect gift and they really enjoyed it.\nI personally LOVE the strawberry and pineapple ones. But strawberry as green? Amazing!", "HIlarious reviews, but the thing is, over indulging in any sugar free candy will make you trot a lot quicker.  Eating regular gummy bears in normal amounts will only make your scales rise.", "They arrived packaged in the bag like in the picture. The gummy bears were fresh, not hard or tough. I repackaged them into smaller Ziploc bags to keep them fresh for longer. They're delicious and addicting, but you already know that. Otherwise, you wouldn't be browsing a 5 lb bag of them on Amazon.", "good\n(sorry for bad english)", "Great", "Love gummy's. These taste great and came nice and soft", "Very fresh.  A great hit.  I love the fast shipping too!", "Just keep them sealed so they won't dry and harden.", "Who doesn't love gummi bears!", "Full on sugar gummy bears. Love this, can totally taste the fruit flavors in this bag. Though I can only eat so much of this because I get a stomach ache after awhile. I read the ingredients and was shocked to see that Carnauba wax was in it. That's the same stuff I use on my car. Sheess. That's kinda gross when you think about it (as I kept shoveling more gummy bears into my mouth). Guess my stomach has a nice shine now. Apparently that didn't stop me from eating this, but it did teach me to stop reading the ingredients on things I like. This is one of those times I enjoy living in blissful ignorance.", "I sent this to my coworkers from my last company and they loved it! Not too sweet, and a good chewy texture. They said they enjoyed it :)", "Waste of $12 bucks. Ate half the bag, no explosive diarrhea.", "What can I say. My favorites by far. Not to sweet and don't taste &#34;chemically&#34; ( if that a word )", "Day 1) i really loved that new gummy smell...\nday 2) The gummies have made a 4 inch incision in my anus, i begun to weep with horror as my friend also in the stall next to me, shot a geyser 12 feet up, i knew this was judgment day. Satan came out of my sphincter and begun to whip my butt like paper. the feces were dribbling into my mouth as i fell onto the floor, my friends was dead with that amount of pebbles he got into his mouth. all that was left of my anus was a small gummy that has lodged itself into the 4inch hole, round 2 was about to come, i need a way to lubricated the feces into oblivion. i got a can of lube and sprayed away with some feces going into my nostrils.\nday 3) i am inside my feces, relying on cheese and more gummies for food, please send help", "Its gummy bears. 5 lbs of gummy awesomeness, who doesn't want that.", "It's five pounds of gummy bears.\nSeriously.", "10/10 very effective at causing diarrhea. Just wish it was a bigger size and not so tempting.", "Lool these came really fast and my brother loved them. Yummy!!", "These weren't Haribo at all, they were very good!", "Works as advertised\n. Good price", "Good stuff.", "The pain in my abdominals literally felt like someone made a small incision in the lower right side of my stomach and slowly unraveled and pulled out my intestines only to feed them to Satan's pit bull", "These gummi bears are just fine, don't let the idiots in the review section detour you. These are NOT the sugar-free kind, the geniuses trying to be funny in the reviews should probably head over to that listing because these are just classic gummi bears that will not cause you any intestinal distress. I bought them for the candy bar at my wedding - I ate them, my guests ate them, nobody was on the toilet for several hours/days (at least not from the gummi bears).", ":)", "BEWARE ! - There is a BIG problem with these. Somehow they disappear when you're not looking. I don't know if someone is sneaking into the house and making off with them or what. Maybe space aliens? However, if you don't put these under lock and key, you may never see them again.", "First of all let me say i am a high fructose corn syrup connoisseur.  These are your spot on first rate gummy bear.  I like to leave the bag partially open and allow them to breathe for a few days in order to get the gummy to that perfect slightly harder texture.  All the top notch gummy enthusiasts know that a gummy needs to be properly aged.", "It's my favorite gummy candy in the world! I can eat this 5-pound gummy bear bag for a month or less. That's how much I love these candies!", "I really shouldn't be eating candy. But I originally bought these to pack as a small but unhealthy snack to school and share with friends. But I found another use for them. VODKA GUMMY BEARS! If you soak these in vodka, the gummies grow twice the size and they're gooey and delicious! ;)", "The gummies were excellen t.They were soft and flavorful,just the right sweetness.", "I thought these were Kosher, since the last ones I bought from Haribo were and these were from Turkey. I wish they had made it clear, since I will\nhave to be thrown away!", "It all started that fateful day when I brought home the beautiful bag of sugar free gummies.  I came home from a hard day of work after a quick stop at my local big box stored for some groceries and found this delightful treat, hundreds of little gummy eyes like little puppy dogs staring at me from behind the clear barrier saying, \u0093Please sir, take me home. I will bring you such great joy.\u0094  I was, in fact, hoodwinked by these unholy terrors unbeknownst to me at the time of the horrors that would ensue.\nAs I sat down on the couch and began watching my favorite evening TV shows, I heard the rustling from my kitchen where I had left the bag on the floor.  \u0093Uh oh,\u0094 I thought.  I turned to find not only the dog, but the cat gulping up several gummies all at once.  I shooed them away and raised the now torn bag to higher ground thinking, \u0093They\u0092ll be alright, a little gummy won\u0092t hurt.\u0094  Boy was I wrong\u0085\nMoments later my cat produced such vomiting as I had never seen before, gummies flying across the living room floor.  While cleaning up the residue, I missed the fact that my dog was pawing vigorously on the back door to get out.  I was too late.  Colorful streaks of gummy laden vomit proceeded from my back door into my kitchen.  \u0093Serves them right for eating my gummies,\u0094 I thought, \u0093when will they learn.\u0094\nLater that night as I snacked on my favorite little gummies, I became acutely aware of the severity of the situation when waves of pain like a boa constrictor shot through my abdomen.  I knew this pain, I\u0092d met it before. .. kidney stones!  Off like a rocket I shot to my car realizing I needed medical attention and fast.  Little did I know the terror yet to come.\nI shot through the doors of my local clinic holding my gut, tears streaming down my face, \u0093KIDNEY STONES, OH GOD THE STONES!\u0094 I shouted.  To which the lovely receptionist replied, \u0093Sir, you need to go to the ER at the hospital right now!\u0094 I thought, \u0093Lady, I ain\u0092t gonna make it!\u0094  So I said it, \u0093Lady, I ain\u0092t gonna make it!\u0094  She took my hand and led me back to the rear bathroom and said, \u0093Well, you\u0092ll just have to pass them then.\u0094  There would be no passing today, oh no.\nI realized the situation had changed drastically when the pain proceeded to my back door like a tsunami crashing against the frail structures of a 3rd world country.  They stood no chance.  With ferocity I proceeded to explode in violent thunder, sure that the entire building had heard the echoes from that tiny room.  Wave after wave of Tsunami strength pounded against the seashore of my frail colon.  Before long, there was nothing left.  It was as if dry heaving only from the bowel.\nThat sweet receptionist checked on me like an angel, bringing me cold compresses and medicine.  As I left, long after closing, she rewarded my efforts with a lollipop.  I realized that day, that these gummies were not some sort of heavenly snack, some delightful treat.  They were clinical grade colon cleanser disguised in cute, squishy bodies, their little eyes now haunting me.  I had no choice but to dispose of the rest of the bag in the best way I knew how, distribution to friends and family members on April Fool\u0092s day.  Oh yes, the texting and facebooking was grand!  You\u0092d have thought foreign spies were dropping terrorist attacks on my city with the repercussions of those horrific little bears.\nIf only I had read the reviews here first.", "I have ordered these three times. This last time I received them, over half of the bag was distinctly a different batch. The bottom half of the bag was one solid gooey glob. There was no sign of definition of gummi bears.  It was seriously one huge lump. It is like Haribo can pass this off on mail order stuff because it is more of a pain in the butt to ship back. Where as a candy store would take one look and refuse it. So i paid fr little gummi bears, but i got a huge big blob that i am going to have to put on a cutting board and slice like a heavy loaf of bread.  REALLY ?!?!?", "Great", "I love this", "ate a bunch unknowing of the hell to come.  stomach gas led to rumbling which led to an uncontrollable need to purge from below.  almost made it to the toilet until I had to sneeze and then &#34;it&#34; happened.  i sneezed and pooped uncontrollably.  not a nice way to end your day.  cheers!", "Wish there was a warning label.", "I love these gummy bears. And this is a great price for the size bag. AND unlike the sugar free you dont spend the whole day on the toilet for eating half the bag. LOL", "Who doesn't love gummi bears?\nI purchased these in bulk for a baby shower game. I decorates a large mason jar lid and put these inside the jar, counting them.\nThe attendees had to guess how many were in the jar and they won the jar. It was a lot of fun.\nThe gummi bears were very fresh, super soft and very fruity tasting.", "None", "These are the worst.  They came hard as rocks and went straight to the trash.", "It started out a quiet day. My friend and I were having a great day. We were going to see Jurassic World. As my brother drove us in he asked if we wanted anything because the movie theater prices are so high. Greedly we pounced on the offer like a lion. We had a ten dollar budget so we decided to get a bag of something. My friend found this gem onbthe bottom row. We both liked gummies so we got the bag. We drove to the theater after. We watched about thirty minutes happily. Then the creatures from the depths of the earth called home. Our stomachs growled and twisted, we swaddled ( sprint + waddle ) our way to the restroom. Once inside we tore our pants off and sat, waiting to release the pressure. My sphincter opened up like a fire hose spraying liquid fire. The evil develish creatures crawled out of my intestines. The shockwave of pressure could be compared to Nagasaki. Anyway we missed the movie. Thanks haribo!", "My niece likes them and is working her way through the rather large bag.", "It certainly was a big bag of gummies. Arrived quick, and made some delicious alcoholic treats.", "A lot of gummi bears for the money. These will last us for about 20 years.", "Wow are these good. Took on road trip, gone in four days. Me the only snacker ( shame on me for not sharing and eating privately) will do better next time. Bears no more, give me worms please", "As expected.  Fresh and delicious.", "This was a giant bag of gummies, but I was a bit disappointed as they were stale and kind of hard to chew, although they still tasted ok.", "have ordered several 4 packs, we love our gummies, sons get them every Christmas.  Haribo is the best!  but skip the sugar free  ;)", "Who needs laxatives? These little devils will make your stomach do hoola hoop in minutes after just 10 of them. Potent stuffs, Geneva Conventions should classified these as a form of torture.", "10/10. these gave my whole body an exorsicim.", "Only Haribo!", "Don't buy this you will die from heart disease I have lost generations due to these little bastards.", "Fresh and authentic", "I guess the non diabetics don't know that anything sugar free eaten in large amounts will give you diarrhea.  It usually tells you on the label, If you're not too lazy to read it,  that sugar alcohols have a laxative effect.", "Perfect", "I ate these and i pooped worse than after eating lava sauce from taco bell", "Delicious just as described", "WARNING...do not attempt to eat all in one sitting! Its hard to digest 5 LBs of delicious dummies but you can certainly try!", "Why do they make these!!!! A co worker brought a bag of these in and now we have all been running to the bathroom non stop. I just saw our maintenance guy eating some and I warned him..... he spit them out quickly"]