["None", "None", "None", "None", "None", "None", "This is such a fun cute camera! Each picture has a vintage feel to it, which I love. It's so easy too, just press the button near the lens,and it starts right up! The only bad part is having to buy more film, but it isn't very expensive. I would definitely recommend this camera to anyone who likes vintage things.", "None", "None", "Fall in love with random life photos again!! My Border Collie is terrified of it! lol lol!", "Excellent transaction, highly recommended", "None", "None", "I Love is onlyone and adorable!", "None", "It is exactly what my daughter was looking for. A smaller version of the actual polaroid camera's in my day.  Plus pink is her favorite color.", "gave it to a friend and he loved it", "I love it,beautiful picture but it does get expensive with all the picture but overall I think its a great product", "None", "lower the price", "None", "None", "Daughter wanted this and loves it.  the photo's are about wallet style - she loves that!", "None", "None", "I originally brought to start on my baby book for my son, and this camera is perfect! Everything prints out clear, and it's always at my side.", "None", "This is a great camera (for the people who love cameras)\nIt a cute, stylish camera that is adorable and fun to use-\nmost people would prefer a camera that had internal memory but its fun to actually have the physical photo in your hand, although internal memory would be great though... But anyway this is what the box comes with:\nA great and cute little camera\nBATTERIES! YAY because most cameras dont come with batteries\nA cute little strap to match the color of your camera\nEasy and cute instructions\nBUBBLE WRAP! Who doesn' t love that?\nOk so the actual camera.. Its so cute (i got the blue one) and it takes really high quality adorable cute photos that are great for anything.. You get a tone of accessories for this camera.It is also better then those little portable cameras because they don' t really function that well, so I would recommend this camera because there are:\nDifferent styles and colors\nDifferent colored and styled film\nAMAZING kinds of cases for travel and non-travel\nSO I would definitely recommend this camera for all types of people :)", "None", "This is a really great and easy to use camera. I love the color and the design. I wanted to get a camera that would be easy enough for my grandmother to use, and it is! Shipping was fast and looks exactly like the picture shown.", "my 10 yr old daughter loves it!!!!!!!", "None", "None", "None", "I bought this to use at a photo booth at my daughter's Sweet 16 party. It was the hit of the party. The pictures were great. I dont think the kids put it down all night.  Highly recommend this camera. The pictures are small but it was worth every dime for the fun it brought the party.", "None", "I bought this camera for our wedding to be used in the guestbook. It was such a hit!  And so fun for us the morning after!  The cameras work as well as you would expect, they are certainly not perfect but they are small and instant and adorable.  We continue to use them at home for events.  These cameras a touch bigger and heavier than I expected.  They feel toyish and fragile, but they have been dropped a few times with no issues.  You should just get one to have around... the only caveat is that the film is really expensive.  Not so expensive that it's not worth buying, but expensive enough to be thoughtful about waste.", "None", "None", "Total disappointment! The color &#34;Raspberry&#34; is pretty on the website and on the box the camera comes in but the camera itself is more like a burnt orange color!!"]