["So I have been wanting this camera for years!!! And I finally had enough money to get this plus the accessories! And I'm so in love!!", "This thing is awesome", "My item came in good shape and it worked perfectly", "Easy & Smart", "Great product and line by FujiFilm. Small and compact, easy to carry as well as very light!", "Absolutely adore my new camera. Impressed with how carefully packaged it was. Great gift for others or yourself, the instructions don't come in English though but you can just watch a tutorial on youtube!", "My daughter is going to have a great Christmas!!!!!", "This is such a fun cute camera! Each picture has a vintage feel to it, which I love. It's so easy too, just press the button near the lens,and it starts right up! The only bad part is having to buy more film, but it isn't very expensive. I would definitely recommend this camera to anyone who likes vintage things.", "Was very pleased with it although when I try to take pictures at night it does not show up at all. Idk if I used the wrong setting but yea.", "A bit flimsy and cheap.  Pictures turn out either too dark or too light. Bummed \u001a. I small child would enjoy this but would be expensive to refill photos!", "Fall in love with random life photos again!! My Border Collie is terrified of it! lol lol!", "Excellent transaction, highly recommended", "It's perfect I love it.", "It's a great purchase, it comes complete and nothing is missing. Excellent conditions, I love it!", "I Love is onlyone and adorable!", "I bought this instax mini 8 from Amazon directly (not another dealer through Amazon). It works wonderfully and came in its complete package. I absolutely love it!", "It is exactly what my daughter was looking for. A smaller version of the actual polaroid camera's in my day.  Plus pink is her favorite color.", "gave it to a friend and he loved it", "I love it,beautiful picture but it does get expensive with all the picture but overall I think its a great product", "This is so cute I love this camera it came so quickly \u001a\u001a\u001a\u001a\u001a\u001a\u001a\u001a\u001a\u001a\u001a\u001a\u001a\u001a", "lower the price", "I love this thing, it shipped really fast and it was an amazing birthday gift to myself.", "This is my favorite little toy. It is so much fun to bring to the beach, on a hike, or on a trip to the city. It is durable, but not heavy or too clunky. The style is unique and minimal. Set up is quick, operation is entirely simple.This would make such a wonderful holiday or birthday present.", "Daughter wanted this and loves it.  the photo's are about wallet style - she loves that!", "Beautiful photos. This is the second mini we've bought hoping it was just a fluke. Broke after two photos. All the red lights flashed and wouldn't load.", "Amazing!", "I originally brought to start on my baby book for my son, and this camera is perfect! Everything prints out clear, and it's always at my side.", "B'day gift for 11/30.  Looked good to me.", "This is a great camera (for the people who love cameras)\nIt a cute, stylish camera that is adorable and fun to use-\nmost people would prefer a camera that had internal memory but its fun to actually have the physical photo in your hand, although internal memory would be great though... But anyway this is what the box comes with:\nA great and cute little camera\nBATTERIES! YAY because most cameras dont come with batteries\nA cute little strap to match the color of your camera\nEasy and cute instructions\nBUBBLE WRAP! Who doesn' t love that?\nOk so the actual camera.. Its so cute (i got the blue one) and it takes really high quality adorable cute photos that are great for anything.. You get a tone of accessories for this camera.It is also better then those little portable cameras because they don' t really function that well, so I would recommend this camera because there are:\nDifferent styles and colors\nDifferent colored and styled film\nAMAZING kinds of cases for travel and non-travel\nSO I would definitely recommend this camera for all types of people :)", "I love it", "This is a really great and easy to use camera. I love the color and the design. I wanted to get a camera that would be easy enough for my grandmother to use, and it is! Shipping was fast and looks exactly like the picture shown.", "my 10 yr old daughter loves it!!!!!!!", "so fun and easy! nice to have ease of use and instant gratification in lieu of a digitally complex world", "I love it!!! It's smaller than I expected but it's still a good size.But my complaints are that I put film in the camera but didn't change the number of how much I got also it feels cheap.", "Great little camera, however the film is just as expensive!", "I bought this to use at a photo booth at my daughter's Sweet 16 party. It was the hit of the party. The pictures were great. I dont think the kids put it down all night.  Highly recommend this camera. The pictures are small but it was worth every dime for the fun it brought the party.", "GREAT PICTURES AND MY GIRLFRIEND LOVES THE QUALITY, BETTER THAN THE POLAROID I BOUGHT HER EARLIER THIS YEAR.", "I bought this camera for our wedding to be used in the guestbook. It was such a hit!  And so fun for us the morning after!  The cameras work as well as you would expect, they are certainly not perfect but they are small and instant and adorable.  We continue to use them at home for events.  These cameras a touch bigger and heavier than I expected.  They feel toyish and fragile, but they have been dropped a few times with no issues.  You should just get one to have around... the only caveat is that the film is really expensive.  Not so expensive that it's not worth buying, but expensive enough to be thoughtful about waste.", "Absolutely love my Instax.  I take it on vacations with me and to outings with my friends and family.  I have never been disappointed with a shot unless I put it on the wrong setting.  Definitely would recommend this no matter what color you buy.  I bought this one because it was the cheapest color at the time - but I fell in love with the color once I had it in my hand.", "I bought this for my daughters for Christmas last year and they absolutely love it! The pictures come out clear, it is very simple to use, and it's fun for kids!", "Total disappointment! The color &#34;Raspberry&#34; is pretty on the website and on the box the camera comes in but the camera itself is more like a burnt orange color!!", "Quick shipping. LOVE THIS CAMERA I AM OBSSESED!!! Made my aunt cry for\nHer birthday when she received photos that were printed right then and there. And it actually has a very wide range! Fits a lot of people! Love love love!", "This was a big hit at my wedding. I love it! The color is so cute!", "This is the first polaroid camera I have ever bought and it was so worth it. It's so cute and portable, not only do I get vintage inspired films from this I get to have the pictures almost instantly. So much worth the buy, now I can account on all my events to be captured into pictures.", "I bought it as a birthday gift for my 15 year old granddaughter and she absolutely loves it.  My only concern might be that the price of the film is a little on the high priced end.  But all in all - it was a huge hit with her.", "perfect! exactly what i wanted! just wish film wasn't so expensive!", "I recently signed up for Amazon Prime Now, which had become available in my locale. This morning I was just playing with the iPhone app and by chance saw this for sale, so I just ordered it. After all, I have been missing the good ol' days of Polaroid instants.\nIt was delivered within the promised delivery window, along with some extra film packs. I popped in the included 2 AA batteries and a film pack. (Film pack is not included in the standard package.) The power button is actually a len extension lever button in the front, located next to the lens. Pushing the button extends out the lens and powers on at the same time. There's a very small optical viewfinder. Focus appears to be the .6m to infinity focus-free type. Exposure is a bit weird and annoying: there're five indicators on the lens itself - indoor, cloudy, partly cloudy, sunny, and &#34;hi-key.&#34; The instruction sheet gives you the corresponding F stops. Obviously indoor uses a slow F stop, with Hi-Key using a even slower stop to let in extra light which results in a highly exposed picture.\nWhat's annoying is to get the correct exposure, you must point the lens at your subject, then observe which indicator light is lid, then turn the lens to that light. Two problems: 1. when you look at the indicator lights, you're going to hold the camera different than when you frame your shot, so the indicator may have changed - this is a really dumb design. 2. you may simply forget to turn the lens to the right exposure. Why Fujifilm implemented such a dumb system, is beyond me.\nLuckily, the exposure doesn't appear to do much to the end product, which is your instant photo. The flash is on for every picture - so be sure you don't use this in an environment where flash is prohibited. You must use the Instax mini film packs; they also make other packs such as the wide type which cannot fit inside this model.\nAfter pressing the shutter which is located on the front of the camera &#34;beneath&#34; the viewfinder (if you hold the camera vertically), out pops the Polaroid-style photo from the top of the camera (if you hold it vertically). Development seems to take much longer than I remember with Polaroids. I have timed the process: 30 seconds to any hint of image appearing, and a full 2 minutes to a decently developed photo, and 5 minutes for the development to settle. I remember (of course I could be wrong about this) I was able to get a Polaroid photo within 1 minute of taking the picture.\nSpeaking of Polaroid, your photos will look just like the old Polaroids, but perhaps with slightly better contrast. The film itself is rated ISO 800 so there is not much in way of resolution. The camera does tend to over-expose. Coupled with the always-firing flash, pictures tend to come out with lots of highlights, which does make most of us look more attractive than with a real camera.\nIn the end, this is a &#34;novelty&#34; item that uses a technology that went back to the 60s and matured in the 70s. I have to say while I'm having a lot of fun with it (here's someone who takes close to 30,000 digital photos every year), I'm disappointed the technology has not improved, and may have come out worse in terms of film-processing speed.  I just hope the photos don't fade as fast as the old Polaroids.\nI'm going to order an accessory kit to add to the functionality. Going to Disney World next week with a bunch of old friends. Hopefully this will add some interesting fun to the trip. Since each film pack comes with only 10 films, I will have to load up on the film. BTW the film packaging warns you not to run these through X-ray machines.", "I love this camera! It's pretty lightweight and easy to use. The only thing that made me slightly disappointed is that the color shown in the image is more pink than what the actual product looks like. It's a more of a washed out reddish pink.", "Great birthday present for granddaughter on her 14th birthday.", "Never got it to work.\nI'm really really iupset because I've replaced the batteries multiple times, followed the directions and have tried multiple different film cartridges but it never turned on!", "cant wait to take pics", "Love this little toy. Bought this for my gf as a gift and she loved it. The picture quality is good as a polarized camera. No other complains. Satisfied!", "Love it ! Great Conditions!", "I bought this for a photo booth at a small carnival. It was a HUGE hit. Easy to use and load film. I'm very happy with my purchase.", "Love it! Takes amazing pictures", "So I purchased this camera since it looked cool. But when I received it the camera would not turn on even with the compatible film. Then I bought a second one in pink, the film exploded with ink. What a horrible product. Rip off, don't buy.", "Easy to use. Automatic lighting sensor tells you which of the 4 settings to use. Love it!", "Adorable fun camera! Works great and speedy shipping!", "Fast shipping, got here a day before than expected. Really amazing price too, will definitely come back here if I ever buy another.", "Cute camera at such an affordable price . Can't wait for my daughter to see her Christmas Present.", "Its great", "I bought as a Christmas gift for my daughter - she hasn't used it yet.  She is very excited about this!", "BEST camera ever! It's a cool new instant camera, and it works like a charm!  There isn't anything that I would say bad about it!", "I'm not sure how I feel about this item. It came in very dirty, red stains along the front cover of where you put the film. Some type of ink dark black stain near the top of the camera. A little bit of brown stains. Poorly packaged, everything was just stuffed in there along with user manual and guide.  was buying this as a gift hoping the box was at least decent looking. But then again it was clearly stated that the box wasn't looking new I give them that. But over all I feel as if the box was more discriptive it's self than the actual product.", "I thought I would use this camera all the time.  I was afraid of the cost of the film because of how much I was going to use it... nope.  It's a great idea for young children or for a party.  Not so much if you're a grown adult that has a job and can afford a real camera or if you own a smartphone.\nThe picture quality is ok.  It's reminiscent of the old style poloroids from the 80s.  The thing is that like movies and tv, cameras have gotten better.  Much much better.  So don't be shocked if you can't really make out the details of a picture you took of your kids 20 feet away.\nAlso take a look at the size of the pictures.  It's a lot smaller than the old style poloroids about half the size.\nThis being said.  My children really like this camera.  I think because they were born to a time where we have automatic sensor lights in our house and Amazon's Echo tells us answers to whatever we ask it.  They have no idea what a land line phone is and TV has always been high def.  So a poloroid camera is a novelty and the manual process of producing a picture is like magic to them.  They can have a picture on paper (and not on the camera where they live).  I can see kids up to 12 really getting a kick out of this.  So the kid in me is giving this 4 stars.  If you have money to burn then buy this product.", "Good one", "100 %Satisfied", "Great camera for my 5 yr old girl, who had wanted instant camera for a while now. She loved taking pictures AND getting the prints right away, as opposed to all the digital stuff we have. Word of a caution: be sure to let your kid know NOT to open the back of the camera where the film goes. My kid opened and wasted the full film pack (she actually took out the whole pack, and removed each film, one by one). And those things are not cheap :).\nOverall I'm happy with the purchase. It's much better present (I wouldnt call that a toy, as it has an actual use) than all other disney crap she wants. While camera is relatively not expensive, the films are, so keep this in mind. (Gillette using guys will know what I'm talking about ;))", "Love this camera! It's not only super cute, but it's so much fun to use. I loved my Polaroid camera when I was a kid so I'm glad Fuji made this. It's a fun camera to use.", "Love love it!! Wish I would have bought this a long time ago it's so much fun!", "button to take pictures - broken.  replaced it with store bought instead of waiting for a replacement.", "Exactly what I ordered:-) comes with batteries too, but film is separate I just bought it at bestbuy. Love it!", "Bought this camera as a gift for my daughter. She loved it. It was easy to use and reload film.", "I got this camera as a gift and I absolutely love it! It\u0092s portable and light and you can take it practically anywhere! It has four settings that you can set it to: outdoors, indoors, cloudy, and sunny. It also has a flash that the camera uses for every picture that you take. It does need batteries, but mine came with some so I didn\u0092t have to worry about buying any. You do need to buy the camera film in order to take pictures. You can purchase the film at target, Walmart, best buy, etc. The film comes with ten but sometimes you can buy two for the price of twenty.\n The quality of the camera is great! The pictures come out looking soft and it gives you a sense that it\u0092s old but in a good way. I highly recommend this camera to anyone it\u0092s good for any occasion and you don\u0092t have to worry about printing out the pictures later since the camera is an instant film!\nP.S. sorry to whoever read this and thought it was dumb, I had to do this for a class assignment", "I bought this for my 7 yr old for her birthday. At first she wasnt very excited only because she didnt know what it was. After opening it up and showing her a picture after bring taken she thought it was the coolest thing ever. Almost like magic watching an image appear. She could load the film and operate it alll on her own its so simple. Perfectly pink any girl will love the color. Lots of fun for any photographer. Just wish film was cheaper.", "Exactly what I was looking for!", "Works great! My girlfriend loves it and the pictures turn out really good. Only reason it doesn't get 5 stars is because of the price of the film. Other than that is a fun little camera.", "This is a Christmas gift for my granddaughter which I know she will love.  Her favorite color is pink!!!", "Great", "I find that it only takes good photos indoors, with proper lighting, and u need to be at least 3 feet away from the subject. No matter what the setting is on, outdoor photos in bright light turn out completely white. Very disappointed.", "It is adorable first of all. It also brings a bit of nostalgia to me from growing up in the 90's. This camera is a hit where ever I go, people always ask me where I bought it. I have since moved on to the instax 300 wide camera but this camera will always have a special place in my heart.", "Great Gift for my Daughter", "I am IN LOVE with this camera!  It's really cool, feels good in the hands, and takes pretty good pictures. The only downside is the cost of film, and how long it takes to ship. Overall I would really recomend getting this Fujifilm instax mini 8.  '''", "No problems at all! Loved the color! The package arrived safely and on time.", "Bought this for a friend's birthday. He loves it. The pictures come out great!", "Nice little quirky thing to own. It worked as expected producing the pictures as expected", "Looks wonderful! Arrived here faster than states. Couldn't ship film so I will need to hunt some down.", "LOVE", "Got this for my daughter and she loves it!!  She also got the film.  The pictures are smaller than the Polaroid pictures.  The camera is very easy to use.  Great item that teen girls love!!", "lots of fun", "I absolutely  love this camera that only downside is the price of film. I can't  wait to use it for holiday parties along with same photo booth props.", "My daughter really enjoys it. I think it's a huge waste of money.", "It broke after having it for one week. Pictures for stuck and wouldn't come out. So disappointed.", "I LOVE THIS CAMERA!  It is so cute!  The picture quality is great!  I'm using this for my wedding guestbook, but I bought it early to play with it.  I'm so glad I did as I cannot stop using it!  I'm glad Amazon has affordable film!  Also, the pink is adorable.", "Love the colors of the photos coming out of it. manages to get everyone excited to see how the photo came out. The eye lens shows a smaller farm then the photos when they come out, a bit annoying in group pics.", "Excellent camera. The kids had a great time with this. Photos are small, but capture everything perfectly.", "This was a gift for Granddaughter.  She loved it.", "I'm only giving this three stars, because it was broken when I received it. It did not take pictures and would keep flashing. I've taken out the batteries and put in new ones, still nothing. I went and got one from Target instead and it works fine, so I will be returning the one I got from Amazon. Probably just had bad luck, but I do like the camera overall (I would have given it 5/5 if the one I received actually worked)", "Oh my gosh! I love this camera, I'm taking it with me everywhere!!! I bought 50 sheets of film but I honestly don't think it's enough haha! Probably going to buy a lot more next paycheck! Love this camera, the pictures are small but they are really cute, the pictures take about less than 3 minutes to fully process, this camera is adorable and so worth it! Considering they sell these for way more! My package came perfectly, nothing wrong with it, came with batteries, it did take a while for it to come though but it was worth the wait!", "Great item", "Thanks its very good and the delivery fast", "Great", "Love it", "Excelent product", "My daughter purchase this for her birthday and i believe its a perfect little gift for a 12 year old, its super fun to take when she is hanging out with her friend. Perfect memories. She put them on the back of her case or on her walls.", "Good product. My friend bought this and I wanna buy one.", "This looked so beautiful. I love it.", "Love it! Everything works and looks perfect! Ordered more for my family. friends love it too!", "This is the cutest and neatest camera I have ever owned. The ONLY thing that I didn't like was it is not digital, but that's the uniqueness about this camera! It is like an old fashioned polaroid camera but the pictures are like credit card size, instead of the full size polaroids. I absolutely love the assortment of colors they offer. The only thing that I wish is that the camera would have come with a small starter set of polaroid film, but other than that this camera was so easy to use and the pictures that I took look like I took them bag in the 80s, they just have that old authentic polaroid look to them! There are different settings on the camera to allow you to adjust it according to if you're outside/inside, etc. Great camera to own. I have no complaints at all!!!", "Thanks to this, my daughter love this so much. She said that its super cute.", "I love this camera!!! I traveled all over Europe and took tons of photos.", "More red, then magenta but that was what I was wanting so its perfect!", "Had this on my wishlist forever and finally got it as an anniversary gift! I was super excited for this one. It's one of those nostalgic items, for the retro kid in me - snapping pictures of anything and everything, everywhere I go. The camera itself does kind of feel like a cheap plastic toy, but the quality is good and it's so fun to use.", "In a word? Obsessed.\nEver since I got this camera in late September, I have brought it to several parties as well as cons. Whenever I bring it, everyone always want to take home the images, so I have to be judicious with who gets to take one home, otherwise I'm spending money on film I never see. I read other reviews about how popular the camera was with friends and family, and I can contest that it really is. People are surprised when they see it, and then curious about the lineage of how instant cameras have progressed to this point of small and compact size.\nMy entire reason for getting it was to take it to AWA to snap pictures of people in costume, and have a physical representation of the convention experience. And because I have somewhat of a type-A personality, I did extensive research on multiple models over the course of several days. This is something I learned early on: every single person will call it a Polaroid. Not a single one wanted to call it an Instax, even after finding out that\u0092s what it was. Kind of interesting how much the Polaroid brand has withstood the test of time, like how people say Kleenex instead of tissue. These Pros/Cons were taken before the purchase of the camera, and were generally what other people said over several platforms (Amazon, FujiFilm website, other blog posts). At the time of purchase, I got this model for 67.98, which was in line with all the other colors. Because it\u0092s a popular color, it looks like they\u0092ve upped the price.\nIn case you aren\u0092t looking to comparisons and you just want to know why I chose this model, I ended up deciding on the 8 for several reasons. While the cameras from 25 and beyond have a button feature for horizontal and vertical, the 8 doesn\u0092t. I am completely fine with tilting the camera either way, and I have never had an issue taking vertical shots. The 8 also had a price point and purpose I think agreed with each other. For less than $70 I could get an instant camera to take to parties and conventions, a camera I could also use for when I have a Photobooth set up at parties. And the final deciding factor was the color and design. The 8 comes in a variety of colors, including the beautiful pastel blue I decided on. While some people thought the design looked cheesy and cheap, I really loved it! I liked the lightweight feel and compact size and the cute sort of toy look of it appealed to my nostalgic side.\nBy far, the best camera is the 90. It offers an option to turn the flash on/off, which I could say is the biggest caveat of all of the other cameras in this series. Because the flash is always on the 8, it washes out pictures taken in bright light. I\u0092ve mostly used the 8 inside and at parties, ant it performs very well in that environment.\nAt any rate, here are my findings:\nFujiFilm Instax 210 Instant Wide (camera priced at $72.89 as of 11/11, $15.99 for 20 exposures)\nNote: Takes 4 AA batteries.\nPROS:\n-Better at outdoor images than smaller Instax cameras, because they show more detail.\n-Larger photo size, about 2x bigger than the mini.\n-More like a classic Polaroid from the \u009190s, so it has a really nice nostalgia factor.\n-Has 3 different camera modes: lighten, darken, and normal.\n-Tends to look best with a horizontal shot, but you can turn the camera for a vertical shot.\nCONS:\n-Bulky, not easy to carry in a pocket or small purse.\n-Auto flash.\n-Not conducive to traveling, due to its large size.\n-Fragile construction.\nRecommended for: Anyone who wants more of a classic Polaroid feel, with larger images.\n____\nFujiFilm Instax Mini 8 (camera priced at $67.49 \u0096 72.00 as of 11/11, $15 for 20 exposures)\nNote: Takes 2 4AA batteries.\nNote: Just because this camera doesn\u0092t offer an option for horizontal and vertical images does not mean you can\u0092t simply tilt the camera, because you definitely can!\nPROS:\n-Small photo size, about the size of a business card.\n-Portable and easy to travel with.\n-Takes good indoor/outdoor photos.\n-Camera itself is available in many colors.\n-Cute design.\n-Sturdy construction.\n- Has 4 settings: indoor, cloudy, little sun, sunny.\nCONS:\n-Small photo size (both a pro and con).\n-Easy to over and underexpose film.\n-Jamming film problem with some people. (though I haven\u0092t had this issue yet)\n-No zoom function. You get one lens, and that\u0092s all. (A close up lens is sold separately, however.)\n-Auto flash.\n-Looks like a toy. Some people said they didn\u0092t like the look and considered it \u0093cheap\u0094.\nRecommended for: Casual use: weddings, parties, get-togethers.\n___\nFujiFilm Instax 25 Mini (camera priced at $84.13 as of 11/11, $15 for 20 exposures)\nNote: Comes with 2 CR2 batteries.\nPROS:\n-Small photo size.\n-Self-portrait mirror for those of you who want an \u0093old school selfie\u0094.\n-Smaller and lighter than the 8 because it doesn\u0092t use the AA batteries that 8 uses.\n-Portable and easy to travel with.\n-Cute-sy design.\n-Comes with a close-up macro lens.\n-An option for horizontal and vertical images.\n-Lighten/darken image mode or turn on flash.\n-Takes good indoor/outdoor photos.\nCONS:\n-Small photo size (both a pro and con).\n-Limited color selection.\n-Doesn\u0092t take very good nighttime shots.\n-Auto flash.\nRecommended for: Casual use: weddings, parties, get-togethers. Those that want to take \u0093selfies\u0094.\n____\nFujiFilm Instax 50S Mini (camera priced at $90.99 as of 11/11, $15 for 20 exposures)\nNote: Comes with 2 CR2 batteries.\nPROS:\n-Small photo size.\n-Self-timer.\n-Comes with a close-up macro lens.\n-Good in low light.\n-An option for horizontal and vertical images.\n-Sleek, more of an adult look to it.\n-3 settings: Auto, Fill-in Flash, and Landscape. Also has a light/dark function.\nCONS:\n-Small photo size (both a pro and con).\n-Auto flash.\n-Tendency to overexpose, especially when it\u0092s overcast.\nRecommended for: Casual use, and those that like the option of taking close-up pictures.\n____\nFujiFilm Instax Mini 90 (camera priced at $137.49 \u0096 140.49, $15 for 20 exposures)\nNote: Comes with rechargeable battery and wall charger.\nPROS:\n-Small photo size.\n-Sleek, more of a retro look to it.\n-Sturdy construction.\n-An option for horizontal and vertical images.\n-An option to turn the flash on/off.\n-Can adjust brightness.\n-Special nighttime option makes it great for lower light.\n-Self-timer.\n-Much less bulk and weight than other Instax cameras.\n-Good for travel and very portable.\n-Takes great day and nighttime shots.\n-Digital display tells you how much film you have left.\n-Macro mode for closer images.\n-Has 4 settings.\nCONS:\n-Small photo size (both a pro and con).\n-Much more expensive than other Instax models: you definitely pay for the looks and additional features.\nRecommended for: More serious photographers.", "I love this camera.  I bought it on a whim and it has been so fun to bring to parties and dinners.  My only negative is that the instructions are nearly impossible to read and the film is a little expensive.  But I still love it.", "I LOVE THIS CAMERA....need I say more?", "Great for parties. Everyone loves it.", "MY GRAND-DAUGHTER WAS SO EXCITED ABOUT HER GIFT!!!", "Really very fun camera!! very good quality of the photos!!!", "Great product!", "got mine in today & I am so excited to use it! I won't give it 5 stars because it should at least come with 10 photo films to get started.", "My sister loves this! Definitely brings you back to the golden days and we love that you get the picture instantly! The pictures are clear and everything is extremely easy to use.", "Bought this for a Bridal Shower so the Bride could get a cute book with all her photos in them. Everyone at the party loved it. Huge hit. I will definitely be using it more.", "I really like it.", "The camera works great.", "Gr daughter loved the blue camera. The blue mudder camera case fit the camera perfectly. She couldn't have been happier.", "Beautiful camera. Special design and high quality. That's worth buying.", "It is one of the things that I want to buy.", "I like this one. It seems good!", "really beautiful", "I really want to get one.", "beautiful product", "Lovely color,just I like.", "I like It !", "So beautiful camera. I love it. I want to give it a try.", "My daughter loves it. She's very happy with the camera.\u001a", "It's such a great camera, definitely recommend it \u001a. The pictures come out so clear and nice \u001a\u001a.  It would be an awesome gift for anyone", "I love this camera. I'd never been into photography (and still aren't that interested in it, to be honest!) but this camera makes me enjoy taking pictures very much. I carry it everywhere I go so thank goodness it's light weight. The only downside is that the film is quite expensive for how little you get in each box ($10-$12 for 10 sheets). Some of the reviews of this camera say that the pictures don't come out well, but I haven't had any problems with mine; the colours come in crisp (keep in mind that these pictures are supposed to look &#34;vintage&#34;) and develop very quickly. I also saw some reviews saying how paper jamming is frequent, but I've had my camera for over a month and I've used it at least once almost every day since purchase, and mine hasn't jammed at all. I get so many compliments on how cute this camera is, so I definitely recommend it!", "Perfect", "My favorite camera ever! i ordered it in the color Raspberry and it's super cute (°\u001a°\u001a)", "It's a great lil camera", "I got the camera this past Thursday. It kept taking pictures in complete whiteness. I've adjusted the setting and everything. Even taken the batteries out and the polaroid film and still kept taking those white pictures.", "Great to use for children's parties!  Instant photos for the kids - and you don't have to worry about getting any approval from parents as the kids take home their pics.  Love the &#34;pink&#34; color!  Easy to use...", "my granddaughter loves it-big hit with her friends", "This camera is always the center of the party!", "I bought this for my daughter on her birthday. I really like how it looks and what it does. The quality of photos are amazing. What i really like about this is its price, quite cheaper than the other polaroid camera.", "I bought this camera for my daughter and she loves it! No issues to report yet. Although, I do think the product does seem a little fragile. Handle with care..", "xmas gift", "Great camera", "My sister loved it ^_^ I bought it for her birthday.", "I consider myself an intermediate photographer, and I found it so unfortunate that once I got into photography, Polaroids were a thing of the past. I was so stoked to learn that a new generation of instant camera is so present on the market now!\nI got my camera a few days ago and I've already gone through two packs of film. This is my new favorite thing!\nThe controls are easy to understand, there's a little bit of a learning curve, but that's very small. Four shots, and this camera is now easy-peasy.\nI highly recommend this to novice and professional photographers a like. It's a fun little toy to have, and is well worth the price of the films.", "Bought this as a gift for my friend and she loved it", "I have ALWAYS wanted a camera like this & I love anything that comes in pink. This soft, light pink is so gorgeous & very close to the color of my bedroom. I'm so happy that this came with a wrist strap too. I almost ordered one separately, but glad I didn't. This camera is so easy to use & absolutely adorable. I'm getting tired of all my special moments being electronic, so I want moments I can keep forever. The strap can be put on either side, which is handy. It also has adjustments for each type of lighting. The photo shown was on a super dark, rainy day, so I was happy that our cat actually showed up & was of good quality. Overall, this is an amazing purchase & I couldn't be happier :)", "This little camera is so much fun!! I had purchased it for photos while we travel. And ended up using it for our wedding. They aren't the higest quality but I think that's a bit of the charm!! Film is expensive but worth it if you can afford t for special trips and memories!", "Very nice camera! I absolutely love it and I'm so glad i got it; I already took ten pictures with it!", "This was my plan B for my wedding reception photo booth. Great product. Easy to use. The kids enjoyed hearing how this was a way we took photos in the old days. I am so glad I bought this and the extra film.", "I bought it for my 12 year old daughter and she loves it!!!!! Nice pictures and very fun!!!!!", "super cute and easy to use camera", "It is no longer working. Can i send it back???", "Exactly what I was looking for.  I'd absolutely order again.  It was easy to use and easy to refill.", "I bought this for my daughter's birthday.  It was a hit at the party.  It was something she really wanted and it works great.", "Works great but the function in the lense to change the lighting is broken. Can't always trust the picture will turn out great because of this.", "works greaaaaaat", "love this camera!!", "This was such a hit at my sister's wedding! The camera is great. Photo quality is great and the size is perfect for me. However, the photo paper is expensive if u use it a lot.", "It was a gift for my granddaughter  She loves it!", "camera had dent in the area where the film come out ALSO THIS LOOKS LIKE IT WAS PREVIOUSLY USED THERE ARE OIL MARKS ON THE CAMERA ALSO DENT ON THE BOTTOM IM RETURNING THIS AND PURCHASING ONE FROM URBAN OUT FITTERS", "Got this as a present for my sister. She LOVES it. The pictures are super cute, it's very lightweight and portable, and the instructions are pretty clear.", "As described", "Granddaughters 11th birthday gift. Said it was her best birthday gift ever!", "Color looks nothing like the photo. It's almost orange in color. We returned for the light pink one.", "So much fun!! Bought this for a party and now my nephew thinks I'm magic because I have a camera that prints pictures automatically! And to think, this was just the norm a while back!", "photos are the size of a credit card", "So far great camera", "perfect for my scrapbooking.  bought this one for my boyfriend's mother, who's also a scrapbooker", "Bought this camera for my wife. She really loves it. She especially likes to use it for taking passport like photos for the girl scouts.", "It doesn't really focus for up-close pictures, so I bought detachable selfie lens that supposedly fixes that. I haven't quite figured out how to use it yet because all the instructions are in Chinese. It comes with two AA batteries (appreciated) and a countdown to let you know how many shots are left. Wish it held more than 10 photos at a time! It supposedly has different settings for indoor versus outdoor photos, but for the life of me I cannot figure out if this can take photos without flash yet. The flash always seems to go off, which makes it hard to get photos if you're near any reflective surfaces. That said, it is really satisfying to hold an actual photo in your hands right after taking it. The color is cute too. It feels a little on the cheap side but I got it for $50 so can't complain! The exposure button is a little close to the aperture to be careful or your fingertip will appear in the corner of every photo.", "Enjoyable for that teen!", "Really in love with this. Received this as a gift and I can't be happier. I do wish they came with extra films. It's cute and functional!", "Awesome and fun!", "Enjoyable for that teen!", "Really in love with this. Received this as a gift and I can't be happier. I do wish they came with extra films. It's cute and functional!", "Awesome and fun!", "my little sister loved it and ran around taking pictures all night", "Our granddaughter is enjoying her new camera.", "I love my camera great for capturing moments recommend you buy", "my daughter has really loved this little camera its perfect for her. but the film seems kinda high.", "Great product, good picture quality", "Everthing was ok with the order. Thank you.", "Works great, definetly worth the money.", "I bought this to do our own version of a photo booth at my daughter's 13 birthday party - it took awhile for the younger kids who are used to digital cameras to figure out they had to look through the hole to take a picture - but that gave the rest of us a good laugh! The pictures were fun for people to take home as souvenirs and there was a little bit of space to write the date/event info on.", "instant film camera was a good deal for the money.  also like the color.  kind of difficult to find the film in stores but that's not really an issue.", "so far so good bought about a month or two ago and its been great so happy i made the purchase , still getting the settings figured out for when your outside, I've found if i put the picture setting on the one it tells me , it hasn't come out right,  so be careful with that maybe its just me lol !", "My daughter loves the camera and loves the memories. She loves to make scrap books.", "Cute. Have zoom in function", "My 14 year old Grand Daughter LOVES this!!! She couldn't stop saying Thank you!!!", "Nice artifact.", "Worth the price, instant pictures at your finger tips! Con: A little pricey for the film.", "Great, no problems", "Amazing product! thank you!"]